[
    {
        "idx": 0,
        "text": "The novel concept of non-orthogonal multiple access (NOMA) aided joint radar and multicast-unicast communication (Rad-MU-Com) is investigated.",
        "labels": "PUR"
    },
    {
        "idx": 0,
        "text": "Employing the same spectrum resource, a multi-input-multi-output (MIMO) dual-functional radar-communication (DFRC) base station detects the radar-centric users (R-user), while transmitting mixed multicast-unicast messages both to the R-user and to the communication-centric user (C-user).",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "In particular, the multicast information is intended for both the R- and C-users, whereas the unicast information is only intended for the C-user.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "More explicitly, NOMA is employed to facilitate this double spectrum sharing, where the multicast and unicast signals are superimposed in the power domain and the superimposed communication signals are also exploited as radar probing waveforms.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "First, a beamformer-based NOMA-aided joint Rad-MU-Com framework is proposed for the system having a single R-user and a single C-user.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "Based on this framework, the unicast rate maximization problem is formulated by optimizing the beamformers employed, while satisfying the rate requirement of multicast and the predefined accuracy of the radar beam pattern.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "The resultant non-convex optimization problem is solved by a penalty-based iterative algorithm to find a high-quality near-optimal solution.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "Next, the system is extended to the scenario of multiple pairs of R- and C-users, where a cluster-based NOMA-aided joint Rad-MU-Com framework is proposed.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "A joint beamformer design and power allocation optimization problem is formulated for the maximization of the sum of the unicast rate at each C-user, subject to the constraints on both the minimum multicast rate for each R&C pair and on accuracy of the radar beam pattern for detecting multiple R-users.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "The resultant joint optimization problem is efficiently solved by another penalty-based iterative algorithm developed.",
        "labels": "MTD"
    },
    {
        "idx": 0,
        "text": "Finally, our numerical results reveal that significant performance gains can be achieved by the proposed schemes over the benchmark schemes employing conventional transmission strategies.",
        "labels": "CLN"
    },
    {
        "idx": 1,
        "text": "In radar sensing and communications, designing Doppler resilient sequences (DRSs) with low ambiguity function for delay over the entire signal duration and Doppler shift over the entire signal bandwidth is an extremely difficult task.",
        "labels": "BAC"
    },
    {
        "idx": 1,
        "text": "However, in practice, the Doppler frequency range is normally much smaller than the bandwidth of the transmitted signal, and it is relatively easy to attain quasi-synchronization for delays far less than the entire signal duration.",
        "labels": "BAC"
    },
    {
        "idx": 1,
        "text": "Motivated by this observation, we propose a new concept called low ambiguity zone (LAZ) which is a small area of the corresponding ambiguity function of interest defined by the certain Doppler frequency and delay.",
        "labels": "PUR"
    },
    {
        "idx": 1,
        "text": "Such an LAZ will reduce to a zero ambiguity zone (ZAZ) if the maximum ambiguity values of interest are zero.",
        "labels": "PUR"
    },
    {
        "idx": 1,
        "text": "In this paper, we derive a set of theoretical bounds on periodic LAZ/ZAZ of unimodular DRSs with and without spectral constraints, which include the existing bounds on periodic global ambiguity function as special cases.",
        "labels": "MTD"
    },
    {
        "idx": 1,
        "text": "These bounds may be used as theoretical design guidelines to measure the optimality of sequences against Doppler effect.",
        "labels": "MTD"
    },
    {
        "idx": 1,
        "text": "We then introduce four optimal constructions of DRSs with respect to the derived ambiguity lower bounds based on some algebraic tools such as characters over finite field and cyclic difference sets.",
        "labels": "MTD"
    },
    {
        "idx": 2,
        "text": "Semantic communication, as a promising technology, has emerged to break through the Shannon limit, which is envisioned as the key enabler and fundamental paradigm for future 6G networks and applications, e.g., smart healthcare.",
        "labels": "BAC"
    },
    {
        "idx": 2,
        "text": "In this paper, we focus on UAV image-sensing-driven task-oriented semantic communications scenarios.",
        "labels": "PUR"
    },
    {
        "idx": 2,
        "text": "The majority of existing work has focused on designing advanced algorithms for high-performance semantic communication.",
        "labels": "BAC"
    },
    {
        "idx": 2,
        "text": "However, the challenges, such as energy-hungry and efficiency-limited image retrieval manner, and semantic encoding without considering user personality, have not been explored yet.",
        "labels": "GAP"
    },
    {
        "idx": 2,
        "text": "These challenges have hindered the widespread adoption of semantic communication.",
        "labels": "GAP"
    },
    {
        "idx": 2,
        "text": "To address the above challenges, at the semantic level, we first design an energy-efficient task-oriented semantic communication framework with a triple-based scene graph for image information. ",
        "labels": "MTD"
    },
    {
        "idx": 2,
        "text": "We then design a new personalized semantic encoder based on user interests to meet the requirements of personalized saliency.",
        "labels": "MTD"
    },
    {
        "idx": 2,
        "text": "Moreover, at the communication level, we study the effects of dynamic wireless fading channel on semantic transmission mathematically and thus design an optimal multi-user resource allocation scheme by using game theory.",
        "labels": "MTD"
    },
    {
        "idx": 2,
        "text": "Numerical results based on real-world datasets clearly indicate that the proposed framework and schemes significantly enhance the personalization and anti-interference performance of semantic communication, and are also efficient to improve the communication quality of semantic communication services.",
        "labels": "CLN"
    },
    {
        "idx": 3,
        "text": "Future spacecraft communication subsystems will potentially benefit from software-defined radios controlled by artificial intelligence algorithms.",
        "labels": "BAC"
    },
    {
        "idx": 3,
        "text": "In this paper, we propose a novel radio resource allocation algorithm leveraging multiobjective reinforcement learning and artificial neural network ensembles able to manage available resources and conflicting mission-based goals.",
        "labels": "PUR"
    },
    {
        "idx": 3,
        "text": "The uncertainty in the performance of thousands of possible radio parameter combinations and the dynamic behavior of the radio channel over time producing a continuous multidimensional state–action space requires a fixed-size memory continuous state–action mapping instead of the traditional discrete mapping.",
        "labels": "MTD"
    },
    {
        "idx": 3,
        "text": "In addition, actions need to be decoupled from states in order to allow for online learning, performance monitoring, and resource allocation prediction.",
        "labels": "MTD"
    },
    {
        "idx": 3,
        "text": "The proposed approach leverages the authors’ previous research on constraining decisions predicted to have poor performance through ”virtual environment exploration.”",
        "labels": "MTD"
    },
    {
        "idx": 3,
        "text": "The simulation results show the performance for different communication mission profiles, and accuracy benchmarks are provided for the future research reference.",
        "labels": "CLN"
    },
    {
        "idx": 3,
        "text": "The proposed approach constitutes part of the core cognitive engine proof-of-concept delivered to the NASA John H. Glenn Research Center’s SCaN Testbed radios on-board the International Space Station.",
        "labels": "CTN"
    },
    {
        "idx": 4,
        "text": "Future wireless communication networks are expected to fulfill the unprecedented performance requirements to support our highly digitized and globally data-driven society.",
        "labels": "BAC"
    },
    {
        "idx": 4,
        "text": "Various technological challenges must be overcome to achieve our goal.",
        "labels": "GAP"
    },
    {
        "idx": 4,
        "text": "Among many potential technologies, reconfigurable intelligent surface (RIS) and artificial intelligence (AI) have attracted extensive attention, thereby leading to a proliferation of studies for utilizing them in wireless communication systems.",
        "labels": "BAC"
    },
    {
        "idx": 4,
        "text": "The RIS-based wireless communication frameworks and AI-enabled technologies, two of the promising technologies for the sixth-generation networks, interact and promote with each other, striving to collaboratively create a controllable, intelligent, reconfigurable, and programmable wireless propagation environment.",
        "labels": "BAC"
    },
    {
        "idx": 4,
        "text": "This paper explores the road to implementing the combination of RIS and AI, more specifically, integrating AI-enabled technologies into RIS-based frameworks for maximizing the practicality of RIS to facilitate the realization of smart radio propagation environments, elaborated from shallow to deep insights.",
        "labels": "PUR"
    },
    {
        "idx": 4,
        "text": "We begin with the basic concept and fundamental characteristics of RIS, followed by the overview of the research status of RIS.",
        "labels": "MTD"
    },
    {
        "idx": 4,
        "text": "Then, we analyze the inevitable trend of RIS to be combined with AI.",
        "labels": "MTD"
    },
    {
        "idx": 4,
        "text": "In particular, we focus on recent research about RIS-based architectures embedded with AI, elucidating from the intelligent structures and systems of metamaterials to the AI-embedded RIS-assisted wireless communication systems.",
        "labels": "MTD"
    },
    {
        "idx": 4,
        "text": "Finally, the challenges and potential of the topic are discussed.",
        "labels": "MTD"
    },
    {
        "idx": 5,
        "text": "Integrating the full-duplex capability with quantum communication potentially equips emerging wireless networks with a quantum layer of security for the stringent communication efficiency and security requirements.",
        "labels": "BAC"
    },
    {
        "idx": 5,
        "text": "This paper proposes two new full-duplex quantum communication protocols to exchange classical or quantum information between two remote parties simultaneously without transferring a physical particle over the quantum channel.",
        "labels": "PUR"
    },
    {
        "idx": 5,
        "text": "The first protocol, called quantum duplex coding, enables the exchange of a classical bit using a preshared maximally entangled pair of qubits by means of counterfactual disentanglement.",
        "labels": "MTD"
    },
    {
        "idx": 5,
        "text": "The second protocol, called quantum telexchanging, enables the exchange of an arbitrary unknown qubit without using preshared entanglement by means of counterfactual entanglement and disentanglement.",
        "labels": "MTD"
    },
    {
        "idx": 5,
        "text": "We demonstrate that quantum duplex coding and quantum telexchanging can be achieved by exploiting counterfactual electron-photon interaction gates.",
        "labels": "RST"
    },
    {
        "idx": 5,
        "text": "It is shown that these tasks can be viewed as full-duplex transmission of bits and qubits via binary erasure channels and quantum erasure channels, respectively.",
        "labels": "CLN"
    },
    {
        "idx": 6,
        "text": "As the standardization of 5G solidifies, researchers are speculating what 6G will be.",
        "labels": "BAC"
    },
    {
        "idx": 6,
        "text": "The integration of sensing functionality is emerging as a key feature of the 6G Radio Access Network (RAN), allowing for the exploitation of dense cell infrastructures to construct a perceptive network.",
        "labels": "BAC"
    },
    {
        "idx": 6,
        "text": "In this IEEE Journal on Selected Areas in Communications (JSAC) Special Issue overview, we provide a comprehensive review on the background, range of key applications and state-of-the-art approaches of Integrated Sensing and Communications (ISAC).",
        "labels": "PUR"
    },
    {
        "idx": 6,
        "text": "We commence by discussing the interplay between sensing and communications (S&C) from a historical point of view, and then consider the multiple facets of ISAC and the resulting performance gains.",
        "labels": "MTD"
    },
    {
        "idx": 6,
        "text": "By introducing both ongoing and potential use cases, we shed light on the industrial progress and standardization activities related to ISAC.",
        "labels": "MTD"
    },
    {
        "idx": 6,
        "text": "We analyze a number of performance tradeoffs between S&C, spanning from information theoretical limits to physical layer performance tradeoffs, and the cross-layer design tradeoffs.",
        "labels": "MTD"
    },
    {
        "idx": 6,
        "text": "Next, we discuss the signal processing aspects of ISAC, namely ISAC waveform design and receive signal processing.",
        "labels": "MTD"
    },
    {
        "idx": 6,
        "text": "As a step further, we provide our vision on the deeper integration between S&C within the framework of perceptive networks, where the two functionalities are expected to mutually assist each other, i.e., via communication-assisted sensing and sensing-assisted communications.",
        "labels": "MTD"
    },
    {
        "idx": 6,
        "text": "Finally, we identify the potential integration of ISAC with other emerging communication technologies, and their positive impacts on the future of wireless networks.",
        "labels": "MTD"
    },
    {
        "idx": 7,
        "text": "Integrating sensing functions into future mobile equipment has become an important trend.",
        "labels": "BAC"
    },
    {
        "idx": 7,
        "text": "Realizing different types of sensing and achieving mutual enhancement under the existing communication hardware architecture is a crucial challenge in realizing the deep integration of sensing and communication.",
        "labels": "BAC"
    },
    {
        "idx": 7,
        "text": "In the 5G New Radio context, active sensing can be performed through uplink beam sweeping on the user equipment (UE) side to observe the surrounding environment.",
        "labels": "BAC"
    },
    {
        "idx": 7,
        "text": "In addition, the UE can perform passive sensing through downlink channel estimation to measure the multipath component (MPC) information.",
        "labels": "BAC"
    },
    {
        "idx": 7,
        "text": "This study is the first to develop a hybrid simultaneous localization and mapping (SLAM) mechanism that combines active and passive sensing, in which mutual enhancement between the two sensing modes is realized in communication systems.",
        "labels": "PUR"
    },
    {
        "idx": 7,
        "text": "Specifically, we first establish a common feature associated with the reflective surface to bridge active and passive sensing, thus enabling information fusion.",
        "labels": "MTD"
    },
    {
        "idx": 7,
        "text": "Based on the common feature, we can attain physical anchor initialization through MPC with the assistance of active sensing.",
        "labels": "MTD"
    },
    {
        "idx": 7,
        "text": "Then, we extend the classic probabilistic data association SLAM mechanism to achieve UE localization and continuously refine the physical anchor and target reflections through the subsequent passive sensing.",
        "labels": "MTD"
    },
    {
        "idx": 7,
        "text": "Numerical results show that the proposed hybrid active and passive sensing-based SLAM mechanism can work successfully in tricky scenarios without any prior information on the floor plan, anchors, or agents.",
        "labels": "CLN"
    },
    {
        "idx": 7,
        "text": "Moreover, the proposed algorithm demonstrates significant performance gains compared with active or passive sensing only mechanisms.",
        "labels": "CLN"
    },
    {
        "idx": 8,
        "text": "Relay-assisted free-space optical (FSO) communication systems are exploited as a means to mitigate the limiting effects of the turbulence induced atmospheric scintillation.",
        "labels": "BAC"
    },
    {
        "idx": 8,
        "text": "However, conventional ground relays are stationary, and their optimal placement is not always feasible.",
        "labels": "GAP"
    },
    {
        "idx": 8,
        "text": "Due to their mobility and flexibility, unmanned aerial vehicles (UAVs) provide new opportunities for FSO relaying systems.",
        "labels": "BAC"
    },
    {
        "idx": 8,
        "text": "In this paper, a hovering UAV-based serial FSO decode-and-forward relaying system is investigated.",
        "labels": "PUR"
    },
    {
        "idx": 8,
        "text": "In the channel modelling for such a system, four types of impairments (i.e., atmospheric loss, atmospheric turbulence, pointing error, and link interruption due to angle-of-arrival fluctuation) are considered.",
        "labels": "MTD"
    },
    {
        "idx": 8,
        "text": "Based on the proposed channel model, a tractable expression for the probability density function of the total channel gain is obtained.",
        "labels": "MTD"
    },
    {
        "idx": 8,
        "text": "Closed-form expressions of the link outage probability and end-to-end outage probability are derived.",
        "labels": "MTD"
    },
    {
        "idx": 8,
        "text": "Asymptotic outage performance bounds for each link and the overall system are also presented to reveal insights into the impacts of different impairments.",
        "labels": "MTD"
    },
    {
        "idx": 8,
        "text": "To improve system performance, we optimize the beam width, field-of-view and UAVs' locations.",
        "labels": "MTD"
    },
    {
        "idx": 8,
        "text": "Numerical results show that the derived theoretical expressions are accurate to evaluate the outage performance of the system.",
        "labels": "CLN"
    },
    {
        "idx": 8,
        "text": "Moreover, the proposed optimization schemes are efficient and can improve performance significantly.",
        "labels": "CLN"
    },
    {
        "idx": 9,
        "text": "Low earth orbit (LEO) satellite communications are expected to be incorporated in future wireless networks, in particular 5G and beyond networks, to provide global wireless access with enhanced data rates.",
        "labels": "BAC"
    },
    {
        "idx": 9,
        "text": "Massive multiple-input multiple-output (MIMO) techniques, though widely used in terrestrial communication systems, have not been applied to LEO satellite communication systems.",
        "labels": "GAP"
    },
    {
        "idx": 9,
        "text": "In this paper, we propose a massive MIMO transmission scheme with full frequency reuse (FFR) for LEO satellite communication systems and exploit statistical channel state information (sCSI) to address the difficulty of obtaining instantaneous CSI (iCSI) at the transmitter.",
        "labels": "PUR"
    },
    {
        "idx": 9,
        "text": "We first establish the massive MIMO channel model for LEO satellite communications and simplify the transmission designs via performing Doppler and delay compensations at user terminals (UTs).",
        "labels": "MTD"
    },
    {
        "idx": 9,
        "text": "Then, we develop the low-complexity sCSI based downlink (DL) precoder and uplink (UL) receiver in closed-form, aiming to maximize the average signal-to-leakage-plus-noise ratio (ASLNR) and the average signal-to-interference-plus-noise ratio (ASINR), respectively.",
        "labels": "MTD"
    },
    {
        "idx": 9,
        "text": "It is shown that the DL ASLNRs and UL ASINRs of all UTs reach their upper bounds under some channel condition.",
        "labels": "RST"
    },
    {
        "idx": 9,
        "text": "Motivated by this, we propose a space angle based user grouping (SAUG) algorithm to schedule the served UTs into different groups, where each group of UTs use the same time and frequency resource.",
        "labels": "MTD"
    },
    {
        "idx": 9,
        "text": "The proposed algorithm is asymptotically optimal in the sense that the lower and upper bounds of the achievable rate coincide when the number of satellite antennas or UT groups is sufficiently large.",
        "labels": "RST"
    },
    {
        "idx": 9,
        "text": "Numerical results demonstrate that the proposed massive MIMO transmission scheme with FFR significantly enhances the data rate of LEO satellite communication systems.",
        "labels": "CLN"
    },
    {
        "idx": 9,
        "text": "Notably, the proposed sCSI based precoder and receiver achieve the similar performance with the iCSI based ones that are often infeasible in practice.",
        "labels": "CLN"
    },
    {
        "idx": 10,
        "text": "As a promising technology for 5G networks, device-to-device (D2D) communication can improve spectrum utilization by sharing the resources of cellular users (CUs).",
        "labels": "BAC"
    },
    {
        "idx": 10,
        "text": "However, this is at the cost of generating interference to the CUs.",
        "labels": "GAP"
    },
    {
        "idx": 10,
        "text": "While most existing works focused on eliminating or suppressing the interference between the D2D links and the CUs, such interference could in fact be beneficial for improving the security of cellular communication.",
        "labels": "GAP"
    },
    {
        "idx": 10,
        "text": "Specifically, D2D links may, in return for reusing cellular resources to achieve high spectral efficiency, act as friendly jammers and help the CUs against malicious wiretapping.",
        "labels": "BAC"
    },
    {
        "idx": 10,
        "text": "To reach this win-win situation, D2D resource management has to be designed from a physical layer security perspective.",
        "labels": "BAC"
    },
    {
        "idx": 10,
        "text": "In this paper, we consider the joint optimization of power allocation and channel assignment of the D2D links and the CUs with the aim to provide security to the CUs and improve the spectral efficiency of the D2D links simultaneously.",
        "labels": "PUR"
    },
    {
        "idx": 10,
        "text": "We focus on the challenging downlink resource sharing problem and investigate both single-channel and multi-channel D2D communications.",
        "labels": "MTD"
    },
    {
        "idx": 10,
        "text": "The resulting resource management design problems turn out to be difficult nonlinear mixed integer problems.",
        "labels": "RST"
    },
    {
        "idx": 10,
        "text": "Nevertheless, by exploiting the inherent properties of the formulated optimization problems, we are able to analytically characterize the optimal power allocation of the CUs and D2D links, and develop efficient methods for joint optimization of their channel assignments.",
        "labels": "RST"
    },
    {
        "idx": 10,
        "text": "Simulation results show that the proposed resource management policies outperform several baseline schemes and can indeed achieve the desired twofold objective.",
        "labels": "CLN"
    },
    {
        "idx": 11,
        "text": "Multi-hop communication with the aid of large-scale antenna arrays will play a vital role in future emergence communication systems.",
        "labels": "BAC"
    },
    {
        "idx": 11,
        "text": "In this paper, we investigate amplify-and-forward based and multiple-input multiple-output assisted multi-hop communication, in which all nodes employ hybrid transceivers.",
        "labels": "PUR"
    },
    {
        "idx": 11,
        "text": "Moreover, channel errors are taken into account in our hybrid transceiver design.",
        "labels": "MTD"
    },
    {
        "idx": 11,
        "text": "Based on the matrix-monotonic optimization framework, the optimal structures of the robust hybrid transceivers are derived.",
        "labels": "MTD"
    },
    {
        "idx": 11,
        "text": "By utilizing these optimal structures, the optimizations of analog transceivers and digital transceivers can be separated without loss of optimality.",
        "labels": "MTD"
    },
    {
        "idx": 11,
        "text": "This fact greatly simplifies the joint optimization of analog and digital transceivers.",
        "labels": "MTD"
    },
    {
        "idx": 11,
        "text": "Since the optimization of analog transceivers under unit-modulus constraints is nonconvex, a projection type algorithm is proposed for analog transceiver optimization to overcome this difficulty.",
        "labels": "MTD"
    },
    {
        "idx": 11,
        "text": "Based on the derived analog transceivers, the optimal digital transceivers can then be derived using matrix-monotonic optimization.",
        "labels": "MTD"
    },
    {
        "idx": 11,
        "text": "Numerical results obtained demonstrate the performance advantages of the proposed hybrid transceiver designs over other existing solutions.",
        "labels": "CLN"
    },
    {
        "idx": 12,
        "text": "Traditional communication systems treat messages’ semantic aspects and meaning as irrelevant to communication, revealing its limitations in the era of artificial intelligence (AI), such as communication efficiency and intent-sharing among different entities.",
        "labels": "GAP"
    },
    {
        "idx": 12,
        "text": "Through broadening the scope of the traditional communication system and the AI-based encoding techniques, in this manuscript, we present a novel semantic communication system, which involves the essential semantic information exploration, transmission and recovery for more efficient communications.",
        "labels": "PUR"
    },
    {
        "idx": 12,
        "text": "Compared to other state-of-the-art semantic communication-related works, our proposed semantic communication system is characterized by the “flow of the intelligence” via the propagation of the model.",
        "labels": "MTD"
    },
    {
        "idx": 12,
        "text": "Besides, the concept of semantic slice-models (SeSM) is proposed to enable flexible model-resembling under the different requirements of the model performance, channel situation and transmission goals.",
        "labels": "MTD"
    },
    {
        "idx": 12,
        "text": "Specifically, a layer-based semantic communication system for images (LSCI) is built on the simulation platform to demonstrate the feasibility of the proposed system and a novel semantic metric called semantic service quality (SS) is proposed to evaluate the semantic communication systems.",
        "labels": "MTD"
    },
    {
        "idx": 12,
        "text": "We evaluate the proposed system on Cityscapes and Open Images datasets, resulting in averaged 10% and 2% bit rate reduction over JPEG and JPEG2000, respectively.",
        "labels": "RST"
    },
    {
        "idx": 12,
        "text": "In comparison to LDPC, the proposed channel coding scheme can averagely save 2dB and 5dB in AWGN channel and Rayleigh fading channel, respectively.",
        "labels": "RST"
    },
    {
        "idx": 13,
        "text": "Built-up areas are the main areas for human production and life.",
        "labels": "BAC"
    },
    {
        "idx": 13,
        "text": "The wide availability of high-resolution satellite images provides new opportunities for fine-scale detection and mapping of built-up areas.",
        "labels": "BAC"
    },
    {
        "idx": 13,
        "text": "However, great challenges remain because built-up areas are large-scale composite geographical objects, which contain diverse object classes and complex scenes, and have extremely large feature heterogeneity across space.",
        "labels": "GAP"
    },
    {
        "idx": 13,
        "text": "For the automatic recognition of built-up areas in high spatial resolution satellite images, a block-level built-up area extraction framework combing densely connected dual-attention network and multiscale context is proposed.",
        "labels": "PUR"
    },
    {
        "idx": 13,
        "text": "The proposed method first divides an image into multiscale blocks with a certain proportion of overlap through multisize grids and their multistep offsets.",
        "labels": "MTD"
    },
    {
        "idx": 13,
        "text": "It then uses the constructed lightweight network integrating dense connection and dual attention to realize the feature representation and discrimination of image blocks.",
        "labels": "MTD"
    },
    {
        "idx": 13,
        "text": "Finally, it achieves the refined detection of built-up areas by integrating the prediction results under different divisions through pixel-level multilabel voting.",
        "labels": "MTD"
    },
    {
        "idx": 13,
        "text": "GaoFen-2 satellite images covering Shenzhen city, China, are used to verify the effectiveness of the proposed method.",
        "labels": "MTD"
    },
    {
        "idx": 13,
        "text": "In the five selected test areas, the F1 score of the proposed method ranges from 0.8720 to 0.8983.",
        "labels": "RST"
    },
    {
        "idx": 13,
        "text": "Results visually preserve the integrity of internal morphology and have a well-defined boundary.",
        "labels": "RST"
    },
    {
        "idx": 13,
        "text": "The proposed method shows better performance than the state-of-the-art built-up area extraction methods.",
        "labels": "RST"
    },
    {
        "idx": 13,
        "text": "It can potentially be applied for fine mapping of large-scale urban built-up areas from high-resolution satellite images.",
        "labels": "CTN"
    },
    {
        "idx": 14,
        "text": "Despite high utility in distributed networks, federated learning entails enormous communication overhead due to the requirement of trained model exchange at every global iteration.",
        "labels": "BAC"
    },
    {
        "idx": 14,
        "text": "When the communication resources are limited, as in wireless environments, learning performance can be severely degraded by the communication overhead.",
        "labels": "BAC"
    },
    {
        "idx": 14,
        "text": "On this account, communication efficiency is one of the primary concerns in federated learning.",
        "labels": "BAC"
    },
    {
        "idx": 14,
        "text": "In this paper, we put forth a communication-efficient federated learning system based on the projection of local model updates.",
        "labels": "PUR"
    },
    {
        "idx": 14,
        "text": "Leveraging the correlation of consecutive local model updates, we devise a novel local model update compression scheme based on the projection onto the selected subspace.",
        "labels": "MTD"
    },
    {
        "idx": 14,
        "text": "Furthermore, to avoid error propagation over global iterations and thus improve learning performance, we also develop novel criteria for deciding whether to compress the local model updates or not.",
        "labels": "MTD"
    },
    {
        "idx": 14,
        "text": "The convergence of the proposed algorithm is also mathematically proved by deriving an upper bound on the mean square error of the global parameter.",
        "labels": "MTD"
    },
    {
        "idx": 14,
        "text": "The merits of the proposed algorithm over the state-of-the-art benchmark schemes are verified by various simulations.",
        "labels": "CLN"
    },
    {
        "idx": 15,
        "text": "Millimeter-wave (mmWave) wireless communication system allows a compact antenna array with a large number of colocated elements, which enables flexible array design and beampattern synthesis.",
        "labels": "BAC"
    },
    {
        "idx": 15,
        "text": "However, security is also particularly important but challenging for the fifth-generation (5G) wireless communications, as the broadcasting nature allows any receivers to have a copy of the transmitted signals.",
        "labels": "GAP"
    },
    {
        "idx": 15,
        "text": "In this paper, we propose a hybrid multiple-input multiple-output (MIMO) phased-array time-modulated directional modulation (DM) scheme for physical layer security in mmWave wireless communications.",
        "labels": "PUR"
    },
    {
        "idx": 15,
        "text": "The hybrid MIMO phased-array enjoys the advantages of MIMO in spatial diversity without sacrificing the main advantage of phased-array in coherent directional gain.",
        "labels": "MTD"
    },
    {
        "idx": 15,
        "text": "The essence is to divide the transmit array into multiple subarrays.",
        "labels": "MTD"
    },
    {
        "idx": 15,
        "text": "Each subarray can be used to form a directional beam, while all subarrays are jointly combined to work as an MIMO for higher angular resolution capabilities.",
        "labels": "MTD"
    },
    {
        "idx": 15,
        "text": "More importantly, a time-modulated DM scheme is applied for the phased-MIMO to achieve physical layer security for mmWave wireless communications, even without the knowledge of the eavesdropper's position information.",
        "labels": "MTD"
    },
    {
        "idx": 15,
        "text": "The feasibility of the proposed scheme is verified by numerical results.",
        "labels": "CLN"
    },
    {
        "idx": 16,
        "text": "Owing to the explosive growth of requirements of rapid emergency communication response and accurate observation services, airborne communication networks (ACNs) have received much attention from both industry and academia.",
        "labels": "BAC"
    },
    {
        "idx": 16,
        "text": "ACNs are subject to heterogeneous networks that are engineered to utilize satellites, high-altitude platforms (HAPs), and low-altitude platforms (LAPs) to build communication access platforms.",
        "labels": "BAC"
    },
    {
        "idx": 16,
        "text": "Compared to terrestrial wireless networks, ACNs are characterized by frequently changed network topologies and more vulnerable communication connections.",
        "labels": "BAC"
    },
    {
        "idx": 16,
        "text": "Furthermore, ACNs have the demand for the seamless integration of heterogeneous networks such that the network quality-of-service (QoS) can be improved.",
        "labels": "BAC"
    },
    {
        "idx": 16,
        "text": "Thus, designing mechanisms and protocols for ACNs poses many challenges.",
        "labels": "GAP"
    },
    {
        "idx": 16,
        "text": "To solve these challenges, extensive research has been conducted.",
        "labels": "BAC"
    },
    {
        "idx": 16,
        "text": "The objective of this special issue is to disseminate the contributions in the field of ACNs.",
        "labels": "PUR"
    },
    {
        "idx": 16,
        "text": "To present this special issue with the necessary background and offer an overall view of this field, three key areas of ACNs are covered.",
        "labels": "PUR"
    },
    {
        "idx": 16,
        "text": "Specifically, this paper covers LAP-based communication networks, HAP-based communication networks, and integrated ACNs.",
        "labels": "MTD"
    },
    {
        "idx": 16,
        "text": "For each area, this paper addresses the particular issues and reviews major mechanisms.",
        "labels": "MTD"
    },
    {
        "idx": 16,
        "text": "This paper also points out future research directions and challenges.",
        "labels": "MTD"
    },
    {
        "idx": 17,
        "text": "Communication bottleneck and data privacy are two critical concerns in federated multi-armed bandit (MAB) problems, such as situations in decision-making and recommendations of connected vehicles via wireless.",
        "labels": "BAC"
    },
    {
        "idx": 17,
        "text": "In this paper, we design the privacy-preserving communication-efficient algorithm in such problems and study the interactions among privacy, communication and learning performance in terms of the regret.",
        "labels": "PUR"
    },
    {
        "idx": 17,
        "text": "To be specific, we design privacy-preserving learning algorithms and communication protocols and derive the learning regret when networked private agents are performing online bandit learning in a master-worker, a decentralized and a hybrid structure.",
        "labels": "MTD"
    },
    {
        "idx": 17,
        "text": "Our bandit learning algorithms are based on epoch-wise sub-optimal arm eliminations at each agent and agents exchange learning knowledge with the server/each other at the end of each epoch.",
        "labels": "MTD"
    },
    {
        "idx": 17,
        "text": "Furthermore, we adopt the differential privacy (DP) approach to protect the data privacy at each agent when exchanging information; and we curtail communication costs by making less frequent communications with fewer agents participation.",
        "labels": "MTD"
    },
    {
        "idx": 17,
        "text": "By analyzing the regret of our proposed algorithmic framework in the master-worker, decentralized and hybrid structures, we theoretically show trade-offs between regret and communication costs/privacy.",
        "labels": "RST"
    },
    {
        "idx": 17,
        "text": "Finally, we empirically show these trade-offs which are consistent with our theoretical analysis.",
        "labels": "RST"
    },
    {
        "idx": 18,
        "text": "This paper investigates the secure communication of a cognitive satellite terrestrial network with software-defined architecture, where a gateway is acting as a control center to offer the resource allocation for the wireless systems.",
        "labels": "PUR"
    },
    {
        "idx": 18,
        "text": "Specifically, we propose beamforming (BF) schemes to utilize the interference from the terrestrial network as a green source to enhance the physical-layer security for the satellite network, provided that the two networks share the portion of millimeter-wave frequencies.",
        "labels": "MTD"
    },
    {
        "idx": 18,
        "text": "Supposing that the satellite employs multibeam antenna while the base station is equipped with a uniform planar array, we first formulate a constrained joint optimization problem to minimize the total transmit power while satisfying both the quality-of-service requirement of the terrestrial user and the secrecy rate (SR) requirements of the satellite users.",
        "labels": "MTD"
    },
    {
        "idx": 18,
        "text": "Since the formulated optimization problem is nonconvex and mathematically intractable, we then propose two BF schemes to obtain the optimal solutions with high computational efficiency.",
        "labels": "MTD"
    },
    {
        "idx": 18,
        "text": "For the case of one eavesdropper (Eve), we present a method to convert the nonconvex SR constraint to a second-order cone one and then adopt a penalty function approach to obtain the BF weight vectors.",
        "labels": "MTD"
    },
    {
        "idx": 18,
        "text": "In the case of multiple Eves, by introducing a list of auxiliary variables, we propose a two-layer iterative BF scheme using penalty function approach together with gradient-based method to calculate the BF weight vectors.",
        "labels": "MTD"
    },
    {
        "idx": 18,
        "text": "Finally, simulation results are given to demonstrate the effectiveness and superiority of the proposed BF schemes.",
        "labels": "CLN"
    },
    {
        "idx": 19,
        "text": "In this paper, we spotlight vehicle-to-everything (V2X) communications in 5G cellular networks.",
        "labels": "PUR"
    },
    {
        "idx": 19,
        "text": "Cellular V2X (C-V2X) communications in 5G enable more advanced services with requirements of ultra-low latency and ultra-high reliability.",
        "labels": "BAC"
    },
    {
        "idx": 19,
        "text": "How to make full use of the limited physical-layer resources is a key determinant to guarantee the quality of service (QoS).",
        "labels": "BAC"
    },
    {
        "idx": 19,
        "text": "Therefore, resource allocation plays an essential role in exchanging information between vehicles, infrastructure, and other devices.",
        "labels": "BAC"
    },
    {
        "idx": 19,
        "text": "In order to intelligently and reasonably allocate resources, a self-adaptive fuzzy logic-based strategy is developed in this paper.",
        "labels": "MTD"
    },
    {
        "idx": 19,
        "text": "To evaluate the network performance for this adaptive strategy, a system model for V2X communications is built for urban areas, and typical safety and non-safety services are deployed in the network.",
        "labels": "MTD"
    },
    {
        "idx": 19,
        "text": "Simulation results reveal that the proposed fuzzy logic-based algorithm can substantially improve resource utilization and satisfy the requirements of V2X services, compared with prior counterparts, which cannot provide guaranteed services due to low resource utilization.",
        "labels": "CLN"
    },
    {
        "idx": 20,
        "text": "By providing ultra-high transmission data rate, millimeter wave (mmWave) and terahertz (THz) communications are promising to enable backhaul data transmission in cellular connected unmanned aerial vehicle (UAV) networks.",
        "labels": "BAC"
    },
    {
        "idx": 20,
        "text": "In such networks, with little or no human assistance, connected autonomous UAVs (CA-UAV) can build air-ground networks and achieve seamless wide-area coverage.",
        "labels": "BAC"
    },
    {
        "idx": 20,
        "text": "With the usage of high frequency (i.e., mmWave/THz), radio/radar sensing function is expected to be achieved in wireless networks, which can be used to track UAV for beam tracking in mmWave/THz communications and motion control of UAV.",
        "labels": "BAC"
    },
    {
        "idx": 20,
        "text": "However, it is extremely difficult to jointly design sensing, communication, and motion control since they have been developing in relatively parallel with limited intersections.",
        "labels": "GAP"
    },
    {
        "idx": 20,
        "text": "In this paper, we propose a new integrated scheduling method of sensing, communication, and control for mmWave/THz communications in UAV networks to enable data transmission of the backhaul from UAV to the ground base station (BS).",
        "labels": "PUR"
    },
    {
        "idx": 20,
        "text": "In the proposed method, we first analyze the interactions among sensing, communication, and motion control, where sensing and motion control are strongly coupled to form the sensing-control pattern.",
        "labels": "MTD"
    },
    {
        "idx": 20,
        "text": "Then, we provide a new definition from motion control perspective, i.e., state-to-noise-ratio, which links the relationship between sensing-control pattern activation and data rate determined by beam alignment in mmWave/THz communications.",
        "labels": "MTD"
    },
    {
        "idx": 20,
        "text": "Finally, a closed-form expression is obtained for data rate triggered sensing-control pattern activation design, where both data rate requirement in mmWave/THz communications and motion control performance of UAV are guaranteed.",
        "labels": "MTD"
    },
    {
        "idx": 20,
        "text": "Simulation results show remarkable performance of the proposed method.",
        "labels": "CLN"
    },
    {
        "idx": 21,
        "text": "Terahertz (THz) communication is a promising technique for chip-to-chip communication and wireless personal area networks.",
        "labels": "BAC"
    },
    {
        "idx": 21,
        "text": "In this paper, we present an experimental study and design to realize such THz communication systems.",
        "labels": "PUR"
    },
    {
        "idx": 21,
        "text": "We develop two different chip sets for on-off-keying (OOK) modulation based THz transceivers which include carrier generators, modulators, THz amplifiers, and baseband amplifiers.",
        "labels": "MTD"
    },
    {
        "idx": 21,
        "text": "Specifically, the first chip set integrates the circuit blocks for the OOK modulation without the THz amplifier for short-range communication.",
        "labels": "MTD"
    },
    {
        "idx": 21,
        "text": "In addition, the second chip set design includes the THz amplifier modules to extend the coverage of transmission.",
        "labels": "MTD"
    },
    {
        "idx": 21,
        "text": "For these two chip sets, we experimentally demonstrate the feasibility of the wireless communication at THz frequency bands and assess performance using the bit error rate (BER) analysis.",
        "labels": "MTD"
    },
    {
        "idx": 21,
        "text": "We estimate the BER by calculating the signal-to-noise ratio (SNR) based on the eye diagram and compare with actual BER measurements and Monte Carlo simulations.",
        "labels": "MTD"
    },
    {
        "idx": 21,
        "text": "We also address the impact of the distance, the transmit power, and the data rate for the proposed THz transceivers based on the link budget analysis, and confirm the accuracy of the derived BER expression.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "Beamforming design has been widely investigated for integrated sensing and communication (ISAC) systems with full-duplex (FD) sensing and half-duplex (HD) communication, where the base station (BS) transmits and receives radar sensing signals simultaneously while the integrated communication operates in either downlink or uplink.",
        "labels": "BAC"
    },
    {
        "idx": 22,
        "text": "To achieve higher spectral efficiency, in this paper, we extend existing ISAC beamforming design to a general case by considering the FD capability for both radar and communication.",
        "labels": "PUR"
    },
    {
        "idx": 22,
        "text": "Specifically, we consider an FD ISAC system, where the BS performs target detection and communicates with multiple downlink users and uplink users reusing the same time and frequency resources.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "We jointly optimize the downlink dual-functional transmit signal and the uplink receive beamformers at the BS and the transmit power at the uplink users.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "The problems are formulated under two criteria: power consumption minimization and sum rate maximization.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "The downlink and uplink transmissions are tightly coupled due to both the desired target echo and the undesired interference received at the BS, making the problems challenging.",
        "labels": "BAC"
    },
    {
        "idx": 22,
        "text": "To handle these issues in both cases, we first determine the optimal receive beamformers in closed forms with respect to the BS transmit beamforming and the user transmit power.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "Subsequently, we invoke these results to obtain equivalent optimization problems and propose iterative algorithms to solve them.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "In addition, we consider a special case under the power minimization criterion and propose an alternative low complexity design.",
        "labels": "MTD"
    },
    {
        "idx": 22,
        "text": "Numerical results demonstrate that the optimized FD communication-based ISAC brings tremendous improvements in terms of both power efficiency and spectral efficiency compared to the conventional ISAC with HD communication.",
        "labels": "CLN"
    },
    {
        "idx": 23,
        "text": "With the increasing demand on the data rate of high-definition (HD) remote detection using unmanned aerial vehicles (UAVs), scientists have moved on from the technique of traditional microwave communication to the technique of optical communication.",
        "labels": "BAC"
    },
    {
        "idx": 23,
        "text": "Through transmitting data to a geosynchronous orbit relay satellite at a high data rate, a UAV can release the storage capacity of its hard drive so as to immediately conduct a new round of HD photo shooting.",
        "labels": "MTD"
    },
    {
        "idx": 23,
        "text": "In this case, we construct a theoretical model of a UAV-to-satellite optical communication system.",
        "labels": "MTD"
    },
    {
        "idx": 23,
        "text": "To optimize the system performance, this paper analyzes the Doppler effect, the pointing error effect, and the atmospheric turbulence effect on the communication performance based on a theoretical study and numerical simulations.",
        "labels": "PUR"
    },
    {
        "idx": 23,
        "text": "In terms of the Doppler effect, the extra background noise caused by slightly increasing the optical filter bandwidth at the receiver has a far weaker effect on the communication performance compared with the effects of atmospheric turbulence and pointing error.",
        "labels": "MTD"
    },
    {
        "idx": 23,
        "text": "In terms of the effects of atmospheric turbulence and pointing error, we further analyze the key parameters of both uplink and downlink systems to better understand these effects.",
        "labels": "MTD"
    },
    {
        "idx": 23,
        "text": "The numerical results can provide data references for practical system designs.",
        "labels": "CTN"
    },
    {
        "idx": 24,
        "text": "We propose a novel formulation of the “effectiveness problem” in communications, put forth by Shannon and Weaver in their seminal work “The Mathematical Theory of Communication”, by considering multiple agents communicating over a noisy channel in order to achieve better coordination and cooperation in a multi-agent reinforcement learning (MARL) framework.",
        "labels": "PUR"
    },
    {
        "idx": 24,
        "text": "Specifically, we consider a multi-agent partially observable Markov decision process (MA-POMDP), in which the agents, in addition to interacting with the environment, can also communicate with each other over a noisy communication channel.",
        "labels": "MTD"
    },
    {
        "idx": 24,
        "text": "The noisy communication channel is considered explicitly as part of the dynamics of the environment, and the message each agent sends is part of the action that the agent can take.",
        "labels": "MTD"
    },
    {
        "idx": 24,
        "text": "As a result, the agents learn not only to collaborate with each other but also to communicate “effectively” over a noisy channel.",
        "labels": "BAC"
    },
    {
        "idx": 24,
        "text": "This framework generalizes both the traditional communication problem, where the main goal is to convey a message reliably over a noisy channel, and the “learning to communicate” framework that has received recent attention in the MARL literature, where the underlying communication channels are assumed to be error-free.",
        "labels": "MTD"
    },
    {
        "idx": 24,
        "text": "We show via examples that the joint policy learned using the proposed framework is superior to that where the communication is considered separately from the underlying MA-POMDP.",
        "labels": "CLN"
    },
    {
        "idx": 24,
        "text": "This is a very powerful framework, which has many real world applications, from autonomous vehicle planning to drone swarm control, and opens up the rich toolbox of deep reinforcement learning for the design of multi-user communication systems.",
        "labels": "BAC"
    },
    {
        "idx": 25,
        "text": "In this article, we study the receiver design for the uplink transmission of a human-type communications (HTC) and machine-type communications (MTC) (H&M) coexisted massive MIMO system.",
        "labels": "PUR"
    },
    {
        "idx": 25,
        "text": "We first establish a probability model to characterize the crucial system features including channel sparsity of massive MIMO and signal sparsity of MTC packets.",
        "labels": "MTD"
    },
    {
        "idx": 25,
        "text": "With the probability model, we propose to conduct joint device activity identification, channel estimation, and signal detection.",
        "labels": "MTD"
    },
    {
        "idx": 25,
        "text": "We develop a message-passing-based statistical interference framework to systematically and efficiently solve the joint estimation problem for the H&M coexisted massive MIMO system.",
        "labels": "MTD"
    },
    {
        "idx": 25,
        "text": "Specifically, we propose two receiver schemes based on time-slotted and non-time-slotted grant-free random access for massive machine-type device connectivity.",
        "labels": "MTD"
    },
    {
        "idx": 25,
        "text": "We show that, by exploiting the channel and signal sparsity, our proposed message-passing-based algorithms significantly outperform the conventional training-based approaches in which the device activity state and the channel are estimated by sending pilots prior to data transmission, and are able to approach the genie bound with known signal support in the relatively high signal-to-noise (SNR) regime.",
        "labels": "CLN"
    },
    {
        "idx": 25,
        "text": "Last but not least, we show that there exists a significant gain in terms of the number of admissible devices in the system by allowing H&M coexistence, as compared to orthogonal transmission approaches in which different time/frequency slots are assigned to HTC and MTC services.",
        "labels": "CLN"
    },
    {
        "idx": 26,
        "text": "In this paper, a novel three-dimensional (3D) space-time-frequency (STF) non-stationary geometry-based stochastic model (GBSM) is proposed for the sixth generation (6G) terahertz (THz) wireless communication systems.",
        "labels": "PUR"
    },
    {
        "idx": 26,
        "text": "The proposed THz channel model is very general having the capability to capture different channel characteristics in multiple THz application scenarios such as indoor scenarios, device-to-device (D2D) communications, ultra-massive multiple-input multiple-output (MIMO) communications, and long traveling paths of users.",
        "labels": "MTD"
    },
    {
        "idx": 26,
        "text": "Also, the generality of the proposed channel model is demonstrated by the fact that it can easily be reduced to different simplified channel models to fit specific scenarios by properly adjusting model parameters.",
        "labels": "MTD"
    },
    {
        "idx": 26,
        "text": "The proposed general channel model takes into consideration the non-stationarities in space, time, and frequency domains caused by ultra-massive MIMO, long traveling paths, and large bandwidths of THz communications, respectively.",
        "labels": "MTD"
    },
    {
        "idx": 26,
        "text": "Statistical properties of the proposed general THz channel model are investigated.",
        "labels": "MTD"
    },
    {
        "idx": 26,
        "text": "The accuracy and generality of the proposed channel model are verified by comparing the simulation results of the relative angle spread and root mean square (RMS) delay spread with corresponding channel measurements.",
        "labels": "MTD"
    },
    {
        "idx": 27,
        "text": "Millimeter wave (mmWave) bands have been utilized for the fifth generation (5G) communication systems and will no doubt continue to be deployed for beyond 5G (B5G).",
        "labels": "BAC"
    },
    {
        "idx": 27,
        "text": "However, the underlying channels are not fully investigated at multi-frequency bands and in multi-scenarios by using the same channel sounder, especially for the outdoor, multiple-input multiple-output (MIMO), and vehicle-to-vehicle (V2V) conditions.",
        "labels": "GAP"
    },
    {
        "idx": 27,
        "text": "In this paper, we conduct multi-frequency multi-scenario mmWave MIMO channel measurements with 4 × 4 antennas at 28, 32, and 39 GHz bands for three cases, i.e., the human body and vehicle blockage measurements, outdoor path loss measurements, and V2V measurements.",
        "labels": "PUR"
    },
    {
        "idx": 27,
        "text": "The channel characteristics, including blockage effect, path loss and coverage range, and non-stationarity and spatial consistency, are thoroughly studied.",
        "labels": "MTD"
    },
    {
        "idx": 27,
        "text": "The blockage model, path loss model, and time-varying channel model are proposed for mmWave MIMO channels.",
        "labels": "MTD"
    },
    {
        "idx": 27,
        "text": "The channel measurement and modeling results will be of great importance for further mmWave communication system deployments in indoor hotspot, outdoor, and vehicular network scenarios for B5G.",
        "labels": "BAC"
    },
    {
        "idx": 28,
        "text": "Wireless communication in the TeraHertz band (0.1-10 THz) is envisioned as one of the key enabling technologies for the future sixth generation (6G) wireless communication systems scaled up beyond massive multiple input multiple output (Massive-MIMO) technology.",
        "labels": "BAC"
    },
    {
        "idx": 28,
        "text": "However, very high propagation attenuations and molecular absorptions of THz frequencies often limit the signal transmission distance and coverage range.",
        "labels": "GAP"
    },
    {
        "idx": 28,
        "text": "Benefited from the recent breakthrough on the reconfigurable intelligent surfaces (RIS) for realizing smart radio propagation environment, we propose a novel hybrid beamforming scheme for the multi-hop RIS-assisted communication networks to improve the coverage range at THz-band frequencies.",
        "labels": "PUR"
    },
    {
        "idx": 28,
        "text": "Particularly, multiple passive and controllable RISs are deployed to assist the transmissions between the base station (BS) and multiple single-antenna users.",
        "labels": "MTD"
    },
    {
        "idx": 28,
        "text": "We investigate the joint design of digital beamforming matrix at the BS and analog beamforming matrices at the RISs, by leveraging the recent advances in deep reinforcement learning (DRL) to combat the propagation loss.",
        "labels": "PUR"
    },
    {
        "idx": 28,
        "text": "To improve the convergence of the proposed DRL-based algorithm, two algorithms are then designed to initialize the digital beamforming and the analog beamforming matrices utilizing the alternating optimization technique.",
        "labels": "MTD"
    },
    {
        "idx": 28,
        "text": "Simulation results show that our proposed scheme is able to improve 50% more coverage range of THz communications compared with the benchmarks.",
        "labels": "RST"
    },
    {
        "idx": 28,
        "text": "Furthermore, it is also shown that our proposed DRL-based method is a state-of-the-art method to solve the NP-hard beamforming problem, especially when the signals at RIS-assisted THz communication networks experience multiple hops.",
        "labels": "CLN"
    },
    {
        "idx": 29,
        "text": "Spatial beamforming is an efficient way to realize dual-functional radar-communication (DFRC).",
        "labels": "BAC"
    },
    {
        "idx": 29,
        "text": "In this paper, we study the DFRC design for a general scenario, where the dual-functional base station (BS) simultaneously detects the target as a multiple-input-multiple-output (MIMO) radar while communicating with multiple multi-antenna communication users (CUs).",
        "labels": "PUR"
    },
    {
        "idx": 29,
        "text": "This necessitates a joint transceiver beamforming design for both MIMO radar and multi-user MIMO (MU-MIMO) communication.",
        "labels": "MTD"
    },
    {
        "idx": 29,
        "text": "In order to characterize the performance tradeoff between MIMO radar and MU-MIMO communication, we first define the achievable performance region of the DFRC system.",
        "labels": "PUR"
    },
    {
        "idx": 29,
        "text": "Then, both radar-centric and communication-centric optimizations are formulated to achieve the boundary of the performance region.",
        "labels": "MTD"
    },
    {
        "idx": 29,
        "text": "For the radar-centric optimization, successive convex approximation (SCA) method is adopted to solve the non-convex constraint.",
        "labels": "MTD"
    },
    {
        "idx": 29,
        "text": "For the communication-centric optimization, a solution based on weighted mean square error (MSE) criterion is obtained to solve the non-convex objective function.",
        "labels": "MTD"
    },
    {
        "idx": 29,
        "text": "Furthermore, two low-complexity beamforming designs based on CU-selection and zero-forcing are proposed to avoid iteration, and the closed-form expressions of the low-complexity beamforming designs are derived.",
        "labels": "MTD"
    },
    {
        "idx": 29,
        "text": "Simulation results are provided to verify the effectiveness of all proposed designs.",
        "labels": "CLN"
    },
    {
        "idx": 30,
        "text": "Integrated sensing and communication (ISAC) is a promising technology to fully utilize the precious spectrum and hardware in wireless systems, which has attracted significant attentions recently.",
        "labels": "BAC"
    },
    {
        "idx": 30,
        "text": "This paper studies ISAC for the important and challenging monostatic setup, where one single ISAC node wishes to simultaneously sense a radar target while communicating with a communication receiver.",
        "labels": "PUR"
    },
    {
        "idx": 30,
        "text": "Different from most existing schemes that rely on either radar-centric half-duplex (HD) pulsed transmission with information embedding that suffers from extremely low communication rate, or communication-centric waveform that suffers from degraded sensing performance, we propose a novel full-duplex (FD) ISAC scheme that utilizes the waiting time of conventional pulsed radars to transmit communication signals.",
        "labels": "MTD"
    },
    {
        "idx": 30,
        "text": "Compared to radar-centric pulsed waveform with information embedding, the proposed design can drastically increase the communication rate, and also mitigate the sensing eclipsing and near-target blind range issues, as long as the self-interference (SI) is effectively suppressed.",
        "labels": "MTD"
    },
    {
        "idx": 30,
        "text": "On the other hand, compared to communication-centric ISAC waveform, the proposed design has better auto-correlation property as it preserves the classic radar waveform for sensing.",
        "labels": "MTD"
    },
    {
        "idx": 30,
        "text": "Performance analysis is developed by taking into account the residual SI, in terms of the probability of detection and ambiguity function for sensing, as well as the spectrum efficiency for communication.",
        "labels": "MTD"
    },
    {
        "idx": 30,
        "text": "Numerical results are provided to show the significant performance gain of our proposed design over benchmark schemes.",
        "labels": "CLN"
    },
    {
        "idx": 31,
        "text": "In this paper, we consider the spectrum sharing planning problem for a full-duplex unmanned aerial vehicle (UAV) relaying systems with underlaid device-to-device (D2D) communications, where a mobile UAV employed as a full-duplex relay assists the communication link between separated nodes without direct link.",
        "labels": "PUR"
    },
    {
        "idx": 31,
        "text": "Our design aims to maximize the sum throughput under the transmit power budget, while guaranteeing the coexistence with terrestrial D2D pairs, satisfying the information causality and UAV's trajectory constraints.",
        "labels": "PUR"
    },
    {
        "idx": 31,
        "text": "First, the transmit power planning with a given trajectory is investigated, where a successive convex algorithm is developed by leveraging the D.C. (difference of two convex) programming.",
        "labels": "MTD"
    },
    {
        "idx": 31,
        "text": "Then, we propose a two-step trajectory design method for the given transmit power since the constraints of D2D pairs result in a non-convex feasible set.",
        "labels": "MTD"
    },
    {
        "idx": 31,
        "text": "Furthermore, an efficient spectrum sharing method for an aerial UAV and terrestrial D2D communications is designed by alternately optimizing the transmit power and UAV's trajectory.",
        "labels": "MTD"
    },
    {
        "idx": 31,
        "text": "Finally, simulation results under various parameter configurations are provided to show the effectiveness of the proposed algorithms.",
        "labels": "CLN"
    },
    {
        "idx": 32,
        "text": "This paper investigates a dual-unmanned aerial vehicle (UAV)-enabled secure communication system, in which, a UAV moves around to send confidential messages to a mobile user while another cooperative UAV transmits artificial noise signals to confuse malicious eavesdroppers.",
        "labels": "PUR"
    },
    {
        "idx": 32,
        "text": "Both UAVs have energy constraints and the location information of eavesdroppers is imperfect.",
        "labels": "MTD"
    },
    {
        "idx": 32,
        "text": "We consider a worst-case secrecy rate maximization problem of the mobile user over all time slots.",
        "labels": "PUR"
    },
    {
        "idx": 32,
        "text": "This optimization problem is solved by jointly designing the three-dimensional (3D) trajectory of UAVs and the time allocation (recharging and service or jamming) under practical constraints including maximum UAV speed, UAV collision avoidance, UAV positioning error, and UAV energy harvesting.",
        "labels": "MTD"
    },
    {
        "idx": 32,
        "text": "Specifically, we adopt a more practical UAV-ground channel model with both large-scale and small-scale fading components.",
        "labels": "MTD"
    },
    {
        "idx": 32,
        "text": "Due to the non-convex feasible region constructed by the complicated constraints, directly finding the optimal solution of the original problem is intractable.",
        "labels": "GAP"
    },
    {
        "idx": 32,
        "text": "To address this issue, we decouple the original optimization problem into three subproblems and develop an iterative algorithm to find its suboptimal solution by using the block coordinate descent technique.",
        "labels": "PUR"
    },
    {
        "idx": 32,
        "text": "To solve each subproblem, certain advanced optimization tools, such as integer relaxation, S-procedure, and successive convex approximation techniques, are utilized.",
        "labels": "MTD"
    },
    {
        "idx": 32,
        "text": "Numerical simulation results are provided to corroborate the theoretical derivations and to evaluate the performance of the proposed algorithm.",
        "labels": "MTD"
    },
    {
        "idx": 32,
        "text": "Additionally, the numerical results assist to draw new insights on the 3D UAV trajectory by comparing the performance with conventional two-dimensional (2D) schemes.",
        "labels": "CTN"
    },
    {
        "idx": 33,
        "text": "Integrated sensing and communication (ISAC) has been regarded as one of the most promising technologies for future wireless communications.",
        "labels": "BAC"
    },
    {
        "idx": 33,
        "text": "However, the mutual interference in the communication radar coexistence system cannot be ignored.",
        "labels": "GAP"
    },
    {
        "idx": 33,
        "text": "Inspired by the studies of reconfigurable intelligent surface (RIS), we propose a double-RIS-assisted coexistence system where two RISs are deployed for enhancing communication signals and suppressing mutual interference.",
        "labels": "PUR"
    },
    {
        "idx": 33,
        "text": "We aim to jointly optimize the beamforming of RISs and radar to maximize communication performance while maintaining radar detection performance.",
        "labels": "PUR"
    },
    {
        "idx": 33,
        "text": "The investigated problem is challenging, and thus we transform it into an equivalent but more tractable form by introducing auxiliary variables.",
        "labels": "MTD"
    },
    {
        "idx": 33,
        "text": "Then, we propose a penalty dual decomposition (PDD)-based algorithm to solve the resultant problem.",
        "labels": "MTD"
    },
    {
        "idx": 33,
        "text": "Moreover, we consider two special cases: the large radar transmit power scenario and the low radar transmit power scenario.",
        "labels": "MTD"
    },
    {
        "idx": 33,
        "text": "For the former, we prove that the beamforming design is only determined by the communication channel and the corresponding optimal joint beamforming strategy can be obtained in closed-form.",
        "labels": "MTD"
    },
    {
        "idx": 33,
        "text": "For the latter, we minimize the mutual interference via the block coordinate descent (BCD) method.",
        "labels": "MTD"
    },
    {
        "idx": 33,
        "text": "By combining the solutions of these two cases, a low-complexity algorithm is also developed.",
        "labels": "MTD"
    },
    {
        "idx": 33,
        "text": "Finally, simulation results show that both the PDD-based and low-complexity algorithms outperform benchmark algorithms.",
        "labels": "RST"
    },
    {
        "idx": 34,
        "text": "Wide Area Measurement Systems (WAMS) consist of the measuring and the communication layers (infrastructures) of smart grids, which are used to monitor, operate and control the electrical infrastructure.",
        "labels": "BAC"
    },
    {
        "idx": 34,
        "text": "Resilience is a very important requirement in smart grids, since they must be able to resist in failures at any layer, caused both by intentional attacks or unintentional events.",
        "labels": "BAC"
    },
    {
        "idx": 34,
        "text": "Thus, while cost optimization is usually the most important concern when designing WAMS, increasing the resilience of the WAMS layers should also be considered as an important constraint.",
        "labels": "GAP"
    },
    {
        "idx": 34,
        "text": "In this paper we propose a model for WAMS designing that takes into consideration both optimization and resilience metrics.",
        "labels": "PUR"
    },
    {
        "idx": 34,
        "text": "The proposed model extends a WAMS placement optimization model by combining an optimization algorithm with a graph-based dependency analysis approach that considers the internal dependencies between the measuring and the communication WAMS layers.",
        "labels": "MTD"
    },
    {
        "idx": 34,
        "text": "Based on simulation results, we show that the proposed model increases WAMS resilience by reducing the dependency levels of carefully selected nodes and/or by selectively adding measurement units and/or communication links in places indicated by the proposed algorithm.",
        "labels": "CLN"
    },
    {
        "idx": 34,
        "text": "Thus, our approach can be categorized as a hybrid resilience algorithm that combines both robustness and redundancy.",
        "labels": "CLN"
    },
    {
        "idx": 35,
        "text": "Due to the advancements in cellular technologies and the dense deployment of cellular infrastructure, integrating unmanned aerial vehicles (UAVs) into the fifth-generation (5G) and beyond cellular networks is a promising solution to achieve safe UAV operation as well as enabling diversified applications with mission-specific payload data delivery.",
        "labels": "BAC"
    },
    {
        "idx": 35,
        "text": "In particular, 5G networks need to support three typical usage scenarios, namely, enhanced mobile broadband (eMBB), ultra-reliable low-latency communications (URLLC), and massive machine-type communications (mMTC).",
        "labels": "BAC"
    },
    {
        "idx": 35,
        "text": "On the one hand, UAVs can be leveraged as cost-effective aerial platforms to provide ground users with enhanced communication services by exploiting their high cruising altitude and controllable maneuverability in three-dimensional (3D) space.",
        "labels": "BAC"
    },
    {
        "idx": 35,
        "text": "On the other hand, providing such communication services simultaneously for both UAV and ground users poses new challenges due to the need for ubiquitous 3D signal coverage as well as the strong air-ground network interference.",
        "labels": "GAP"
    },
    {
        "idx": 35,
        "text": "Besides the requirement of high-performance wireless communications, the ability to support effective and efficient sensing as well as network intelligence is also essential for 5G-and-beyond 3D heterogeneous wireless networks with coexisting aerial and ground users.",
        "labels": "BAC"
    },
    {
        "idx": 35,
        "text": "In this paper, we provide a comprehensive overview of the latest research efforts on integrating UAVs into cellular networks, with an emphasis on how to exploit advanced techniques (e.g., intelligent reflecting surface, short packet transmission, energy harvesting, joint communication and radar sensing, and edge intelligence) to meet the diversified service requirements of next-generation wireless systems.",
        "labels": "PUR"
    },
    {
        "idx": 35,
        "text": "Moreover, we highlight important directions for further investigation in future work.",
        "labels": "IMP"
    },
    {
        "idx": 36,
        "text": "End-to-end semantic communications (ESC) rely on deep neural networks (DNN) to boost communication efficiency by only transmitting the semantics of data, showing great potential for high-demand mobile applications.",
        "labels": "BAC"
    },
    {
        "idx": 36,
        "text": "We argue that central to the success of ESC is the robust interpretation of conveyed semantics at the receiver side, especially for security-critical applications such as automatic driving and smart healthcare.",
        "labels": "PUR"
    },
    {
        "idx": 36,
        "text": "However, robustifying semantic interpretation is challenging as ESC is extremely vulnerable to physical-layer adversarial attacks due to the openness of wireless channels and the fragileness of neural models.",
        "labels": "GAP"
    },
    {
        "idx": 36,
        "text": "Toward ESC robustness in practice, we ask the following two questions: Q1: For attacks, is it possible to generate semantic-oriented physical-layer adversarial attacks that are imperceptible, input-agnostic and controllable?",
        "labels": "PUR"
    },
    {
        "idx": 36,
        "text": "Q2: Can we develop a defense strategy against such semantic distortions and previously proposed adversaries?",
        "labels": "MTD"
    },
    {
        "idx": 36,
        "text": "To this end, we first present MobileSC, a novel semantic communication framework that considers the computation and memory efficiency in wireless environments.",
        "labels": "MTD"
    },
    {
        "idx": 36,
        "text": "Equipped with this framework, we propose SemAdv, a physical-layer adversarial perturbation generator that aims to craft semantic adversaries over the air with the abovementioned criteria, thus answering the Q1.",
        "labels": "MTD"
    },
    {
        "idx": 36,
        "text": "To better characterize the real-world effects for robust training and evaluation, we further introduce a novel adversarial training method $\\texttt {SemMixed}$ to harden the ESC against SemAdv attacks and existing strong threats, thus answering the Q2.",
        "labels": "MTD"
    },
    {
        "idx": 36,
        "text": "Extensive experiments on three public benchmarks verify the effectiveness of our proposed methods against various physical adversarial attacks.",
        "labels": "CLN"
    },
    {
        "idx": 36,
        "text": "We also show some interesting findings, e.g., our MobileSC can even be more robust than classical block-wise communication systems in the low SNR regime.",
        "labels": "CLN"
    },
    {
        "idx": 37,
        "text": "In this paper, we investigate the physical-layer security for a spatial modulation (SM)-based indoor visible light communication (VLC) system, which includes multiple transmitters, a legitimate receiver, and a passive eavesdropper (Eve).",
        "labels": "PUR"
    },
    {
        "idx": 37,
        "text": "At the transmitters, the SM scheme is employed, i.e., only one transmitter is active at each time instant.",
        "labels": "MTD"
    },
    {
        "idx": 37,
        "text": "To choose the active transmitter, a uniform selection (US) scheme is utilized.",
        "labels": "MTD"
    },
    {
        "idx": 37,
        "text": "Two scenarios are considered: one is with non-negativity and average optical intensity constraints and the other is with non-negativity, average optical intensity, and peak optical intensity constraints.",
        "labels": "MTD"
    },
    {
        "idx": 37,
        "text": "Then, lower and upper bounds on the secrecy rate are derived for these two scenarios.",
        "labels": "MTD"
    },
    {
        "idx": 37,
        "text": "Besides, the asymptotic behaviors for the derived secrecy rate bounds at high signal-to-noise ratio (SNR) are analyzed.",
        "labels": "MTD"
    },
    {
        "idx": 37,
        "text": "To further improve the secrecy performance, a channel adaptive selection (CAS) scheme and a greedy selection (GS) scheme are proposed to select the active transmitter.",
        "labels": "MTD"
    },
    {
        "idx": 37,
        "text": "Numerical results show that the lower and upper bounds of the secrecy rate are tight.",
        "labels": "RST"
    },
    {
        "idx": 37,
        "text": "At high SNR, small asymptotic performance gaps exist between the derived lower and the upper bounds.",
        "labels": "RST"
    },
    {
        "idx": 37,
        "text": "Moreover, the proposed GS scheme has the best performance, followed by the CAS scheme and the US scheme.",
        "labels": "CLN"
    },
    {
        "idx": 38,
        "text": "To overcome the bottleneck of unreliable environment sensing caused by sensor failure and obstacle blockage, the cooperation among connected automated vehicles (CAVs) is crucial for the reliable and efficient raw sensing data sharing in order to guarantee the driving safety.",
        "labels": "BAC"
    },
    {
        "idx": 38,
        "text": "Empowered by the narrow beamwidth and high data rate abilities, the millimeter wave (mmWave) communication technology can substantially improve the environment sensing ability among multiple CAVs.",
        "labels": "BAC"
    },
    {
        "idx": 38,
        "text": "In this paper, a mmWave enabled CAVs cooperation algorithm is designed based on the proposed time-division integrated sensing and communication (TD-ISAC) system for raw sensing data sharing among CAVs.",
        "labels": "PUR"
    },
    {
        "idx": 38,
        "text": "Considering various computing abilities at vehicle and infrastructure, a closed-form solution to the V2V or V2V/V2I cooperative communication mode selection is theoretically achieved based on response delay analysis to guarantee the timeliness of raw sensing data sharing.",
        "labels": "MTD"
    },
    {
        "idx": 38,
        "text": "And the age of information based system status update algorithm is proposed for the V2V/V2I collaborative communication mode.",
        "labels": "MTD"
    },
    {
        "idx": 38,
        "text": "The feasibility of the proposed TD-ISAC system is verified by simulation and hardware testbed results.",
        "labels": "MTD"
    },
    {
        "idx": 38,
        "text": "Based on simulation results, the proposed communication mode selection algorithm can effectively minimize the response time delay in different conditions.",
        "labels": "RST"
    },
    {
        "idx": 38,
        "text": "The mmWave enabled TD-ISAC hardware testbed is developed and the position error of target detection can be reduced by 18.5 % using the sensing data fusion from two vehicles, while the communication throughput remains over 2.2 Gbps.",
        "labels": "RST"
    },
    {
        "idx": 39,
        "text": "Communication systems to date primarily aim at reliably communicating bit sequences.",
        "labels": "BAC"
    },
    {
        "idx": 39,
        "text": "Such an approach provides efficient engineering designs that are agnostic to the meanings of the messages or to the goal that the message exchange aims to achieve.",
        "labels": "BAC"
    },
    {
        "idx": 39,
        "text": "Next generation systems, however, can be potentially enriched by folding message semantics and goals of communication into their design.",
        "labels": "GAP"
    },
    {
        "idx": 39,
        "text": "Further, these systems can be made cognizant of the context in which communication exchange takes place, thereby providing avenues for novel design insights.",
        "labels": "BAC"
    },
    {
        "idx": 39,
        "text": "This tutorial summarizes the efforts to date, starting from its early adaptations, semantic-aware and task-oriented communications, covering the foundations, algorithms and potential implementations.",
        "labels": "PUR"
    },
    {
        "idx": 39,
        "text": "The focus is on approaches that utilize information theory to provide the foundations, as well as the significant role of learning in semantics and task-aware communications.",
        "labels": "MTD"
    },
    {
        "idx": 40,
        "text": "Distributed learning and multi-tier computing are the key ingredients to ensure ultra-reliable and low-latency communication (URLLC) in 6G networks.",
        "labels": "BAC"
    },
    {
        "idx": 40,
        "text": "The distinct transition from connected things in 5G URLLC networks to connected intelligence in 6G URLLC networks requires ultra-secure communication due to the massive amount of private data.",
        "labels": "BAC"
    },
    {
        "idx": 40,
        "text": "However, it is a challenging task to ensure stringent 6G URLLC requirements along with user privacy and data security in distributed networks.",
        "labels": "GAP"
    },
    {
        "idx": 40,
        "text": "In this paper, we devise a distributed quantum computation protocol to perform a nonlocal controlled unitary operation on a bipartite input state in concealed and counterfactual manner and integrate it with anonymous quantum communication networks.",
        "labels": "PUR"
    },
    {
        "idx": 40,
        "text": "This distributed protocol allows Bob to apply an arbitrary singlequbit unitary operator on Alice’s qubit in a controlled and probabilistic fashion, without revealing the operator to her and without transmitting any physical particle over the quantum channel-called the counterfactual concealed telecomputation (CCT).",
        "labels": "MTD"
    },
    {
        "idx": 40,
        "text": "It is shown that the CCT protocol neither requires the preshared entanglement nor depends on the bipartite input state and that the single-qubit unitary teleportation is a special case of CCT.",
        "labels": "CLN"
    },
    {
        "idx": 40,
        "text": "The quantum circuit for CCT can be implemented using the (chained) quantum Zeno gates.",
        "labels": "MTD"
    },
    {
        "idx": 40,
        "text": "The protocol becomes deterministic with simplified circuit implementation if the initial composite state of Alice and Bob is a Bell-type state.",
        "labels": "MTD"
    },
    {
        "idx": 40,
        "text": "Furthermore, we provide numerical examples of quantum anonymous broadcast networks using the CCT protocol and show their degrees of anonymity in the presence of malicious users.",
        "labels": "CLN"
    },
    {
        "idx": 41,
        "text": "We address the design of inference-oriented communication systems where multiple transmitters send partial inference values through noisy communication channels, and the receiver aggregates these channel outputs to obtain a reliable final inference.",
        "labels": "PUR"
    },
    {
        "idx": 41,
        "text": "Since large data items are replaced by compact inference values, these systems lead to significant savings of communication resources.",
        "labels": "BAC"
    },
    {
        "idx": 41,
        "text": "In particular, we present a principled framework to optimize communication-resource allocation for distributed boosting classifiers.",
        "labels": "PUR"
    },
    {
        "idx": 41,
        "text": "Boosting classification algorithms make a final decision via a weighted vote from the outputs of multiple base classifiers.",
        "labels": "BAC"
    },
    {
        "idx": 41,
        "text": "Since these base classifiers transmit their partial inference values over noisy channels, communication errors would degrade the final classification accuracy.",
        "labels": "GAP"
    },
    {
        "idx": 41,
        "text": "We formulate communication resource allocation problems to maximize the final classification accuracy by taking into account the importance of base classifiers and the resource budget.",
        "labels": "MTD"
    },
    {
        "idx": 41,
        "text": "To solve these problems rigorously, we formulate convex optimization problems to optimize: 1) transmit-power allocations and 2) transmit-rate allocations.",
        "labels": "MTD"
    },
    {
        "idx": 41,
        "text": "This framework departs from classical communication-systems optimizations in seeking to maximize the classification accuracy rather than the reliability of the individual communicated bits.",
        "labels": "MTD"
    },
    {
        "idx": 41,
        "text": "Results from numerical experiments demonstrate the benefits of our approach.",
        "labels": "CLN"
    },
    {
        "idx": 42,
        "text": "The use of light-emitting diodes (LEDs) for ambient illumination leads to visible light communications (VLC) as a promising technology for providing both constant lighting and high-speed wireless services in indoor environments.",
        "labels": "BAC"
    },
    {
        "idx": 42,
        "text": "Since multiple LED sources can be transmitted to several users, this scenario naturally forms a multiple-user multiple-input single-output system.",
        "labels": "BAC"
    },
    {
        "idx": 42,
        "text": "In this sense, transmit precoding (TPC) schemes based on channel state information at the transmitter (CSIT) originally devised for radio-frequency (RF) systems have been proposed for their implementation in VLC.",
        "labels": "BAC"
    },
    {
        "idx": 42,
        "text": "However, beyond providing CSIT or the need for cooperation among transmitters, which also result challenging in RF systems, there are several constraints such as the non-negativity of the transmitted signal or providing constant illumination that hamper the performance of TPC schemes in VLC.",
        "labels": "GAP"
    },
    {
        "idx": 42,
        "text": "Considering these constraints, this paper explores the use of blind interference alignment (BIA) for achieving multiplexing gain without CSIT or cooperation among LED lights.",
        "labels": "PUR"
    },
    {
        "idx": 42,
        "text": "To do that, we devise the concept of reconfigurable photodetector that allows switching among distinct and linearly independent channel responses.",
        "labels": "MTD"
    },
    {
        "idx": 42,
        "text": "Simulation results show that the use of BIA in VLC systems schemes based on the proposed reconfigurable photodetector results suitable for VLC systems.",
        "labels": "CLN"
    },
    {
        "idx": 43,
        "text": "Visible light communication (VLC) equipped with multiple light-emitting diodes (LEDs) can provide near ubiquitous indoor coverage for both communication and illumination.",
        "labels": "BAC"
    },
    {
        "idx": 43,
        "text": "This paper introduces the concept of biased beamforming to explore the full potential of multicarrier multi-LED VLC systems.",
        "labels": "PUR"
    },
    {
        "idx": 43,
        "text": "Biased beamforming includes two components to be jointly designed: a direct current (DC) bias on each LED and a beamforming vector on each subcarrier.",
        "labels": "MTD"
    },
    {
        "idx": 43,
        "text": "We first analyze the impact on clipping in multi-LED VLC systems.",
        "labels": "MTD"
    },
    {
        "idx": 43,
        "text": "Next, we consider the joint optimization of beamforming and biasing to maximize data rate.",
        "labels": "MTD"
    },
    {
        "idx": 43,
        "text": "We find the optimal beamformer and analytically characterize its structure.",
        "labels": "RST"
    },
    {
        "idx": 43,
        "text": "We further optimize the bias on each LED and provide the globally optimal solution in closed form for flat channels, which leads to several critical insights that are helpful for practical systems.",
        "labels": "MTD"
    },
    {
        "idx": 43,
        "text": "We also derive a simplified near-optimal solution for dispersive channels and develop an efficient method for biased beamforming.",
        "labels": "MTD"
    },
    {
        "idx": 43,
        "text": "The performance of the proposed biased beamforming design outperforms existing solutions.",
        "labels": "RST"
    },
    {
        "idx": 44,
        "text": "Unmanned aerial vehicles (UAVs) can be used to serve as aerial base stations to enhance both the coverage and performance of communication networks in various scenarios, such as emergency communications and network access for remote areas.",
        "labels": "BAC"
    },
    {
        "idx": 44,
        "text": "Mobile UAVs can establish communication links for ground users to deliver packets.",
        "labels": "BAC"
    },
    {
        "idx": 44,
        "text": "However, UAVs have limited communication ranges and energy resources.",
        "labels": "GAP"
    },
    {
        "idx": 44,
        "text": "Particularly, for a large region, they cannot cover the entire area all the time or keep flying for a long time.",
        "labels": "GAP"
    },
    {
        "idx": 44,
        "text": "It is thus challenging to control a group of UAVs to achieve certain communication coverage in a long run, while preserving their connectivity and minimizing their energy consumption.",
        "labels": "GAP"
    },
    {
        "idx": 44,
        "text": "Toward this end, we propose to leverage emerging deep reinforcement learning (DRL) for UAV control and present a novel and highly energy-efficient DRL-based method, which we call DRL-based energy-efficient control for coverage and connectivity (DRL-EC3).",
        "labels": "PUR"
    },
    {
        "idx": 44,
        "text": "The proposed method 1) maximizes a novel energy efficiency function with joint consideration for communications coverage, fairness, energy consumption and connectivity; 2) learns the environment and its dynamics; and 3) makes decisions under the guidance of two powerful deep neural networks.",
        "labels": "MTD"
    },
    {
        "idx": 44,
        "text": "We conduct extensive simulations for performance evaluation.",
        "labels": "MTD"
    },
    {
        "idx": 44,
        "text": "Simulation results have shown that DRL-EC3 significantly and consistently outperform two commonly used baseline methods in terms of coverage, fairness, and energy consumption.",
        "labels": "RST"
    },
    {
        "idx": 45,
        "text": "The space-air-ground-sea integrated network (SAGSIN) plays an important role in offering global coverage.",
        "labels": "BAC"
    },
    {
        "idx": 45,
        "text": "To improve the efficient utilization of spectral and hardware resources in the SAGSIN, integrated sensing and communications (ISAC) has drawn extensive attention.",
        "labels": "BAC"
    },
    {
        "idx": 45,
        "text": "Most existing ISAC works focus on terrestrial networks and cannot be straightforwardly applied in satellite systems due to the significantly different electromagnetic wave propagation properties.",
        "labels": "GAP"
    },
    {
        "idx": 45,
        "text": "In this work, we investigate the application of ISAC in massive multiple-input multiple-output (MIMO) low earth orbit (LEO) satellite systems.",
        "labels": "PUR"
    },
    {
        "idx": 45,
        "text": "We first characterize the statistical wave propagation properties by considering beam squint effects.",
        "labels": "MTD"
    },
    {
        "idx": 45,
        "text": "Based on this analysis, we propose a beam squint-aware ISAC technique for hybrid analog/digital massive MIMO LEO satellite systems exploiting statistical channel state information.",
        "labels": "MTD"
    },
    {
        "idx": 45,
        "text": "Simulation results demonstrate that the proposed scheme can operate both the wireless communications and the target sensing simultaneously with satisfactory performance, and the beam-squint effects can be efficiently mitigated with the proposed method in typical LEO satellite systems.",
        "labels": "CLN"
    },
    {
        "idx": 46,
        "text": "Ambient backscatter communication (AmBC) is a promising solution to energy-efficient and spectrum-efficient Internet of Things with stringent power and cost constraints.",
        "labels": "BAC"
    },
    {
        "idx": 46,
        "text": "In an AmBC system, recovering the tag information at the reader, however, is a challenging task due to the difficulty in acquiring the relevant channel-state information (CSI).",
        "labels": "GAP"
    },
    {
        "idx": 46,
        "text": "To eliminate the need to estimate the CSI, in this paper, we propose a label-assisted transmission framework, in which two known labels are transmitted from the tag before data transmission.",
        "labels": "PUR"
    },
    {
        "idx": 46,
        "text": "By exploring the received signal constellation information, we propose modulation-constrained expectation maximization algorithm, based on which two detection methods are developed.",
        "labels": "MTD"
    },
    {
        "idx": 46,
        "text": "One method, referred to as constellation learning with labeled signals, learns the parameters by clustering the labeled signals and recovers the unlabeled signals by the learnt parameters.",
        "labels": "MTD"
    },
    {
        "idx": 46,
        "text": "The other method, referred to as constellation learning with labeled and unlabeled signals, uses all received signals in clustering.",
        "labels": "BAC"
    },
    {
        "idx": 46,
        "text": "Efficient initialization techniques are provided for the two clustering algorithms.",
        "labels": "MTD"
    },
    {
        "idx": 46,
        "text": "Finally, extensive simulation results show that the proposed constellation learning methods achieve comparable performance as the optimal detector with perfect CSI.",
        "labels": "CLN"
    },
    {
        "idx": 47,
        "text": "Medical robots with audio-video-haptic streams, as indispensable devices for remote healthcare, are playing ever-increasing roles in mitigating the spread of infectious diseases.",
        "labels": "BAC"
    },
    {
        "idx": 47,
        "text": "However, existing medical robots are far from precise and efficient because of the following two technical challenges, including i) how to ensure the haptic fidelity for precise manipulation, and ii) how to alleviate the impact of haptic streams on the quality of visual navigation for efficient operation.",
        "labels": "GAP"
    },
    {
        "idx": 47,
        "text": "To this end, this work explores the benefits of edge-based cross-modal communications (CMCs), which take full advantage of potential correlations among different modalities’ streams, to realize high reliability and throughput.",
        "labels": "PUR"
    },
    {
        "idx": 47,
        "text": "Specifically, to compensate for the reliability loss caused by wireless transmission, a semantic-aided cross-modal reconstruction framework is firstly designed at edge nodes for high haptic fidelity.",
        "labels": "MTD"
    },
    {
        "idx": 47,
        "text": "Then, a user experience-driven stream scheduling strategy is developed to enhance the visual quality by fully leveraging edge computing and network slicing.",
        "labels": "MTD"
    },
    {
        "idx": 47,
        "text": "In particular, different from traditionally interrupting audio/video stream transmission to prioritize haptic streams, we jointly schedule resources to different modalities’ streams via estimating haptic arrival time.",
        "labels": "MTD"
    },
    {
        "idx": 47,
        "text": "Finally, as a classical case study, we independently construct a remote throat swab sampling platform based on CMCs to evaluate practical performance, and numerical results indicate the significant improvements in terms of various metrics.",
        "labels": "MTD"
    },
    {
        "idx": 48,
        "text": "The high mobility of future high-speed trains (up to 500 km/h) poses great challenges on the design of dynamic beamforming (BF) algorithms for millimeter-wave (mmWave) communications in high-speed rail (HSR) networks.",
        "labels": "GAP"
    },
    {
        "idx": 48,
        "text": "Thanks to the linear structure of HSR cellular networks, the track of the train is almost predictable.",
        "labels": "CLN"
    },
    {
        "idx": 48,
        "text": "Thus, the fixed BF, i.e., highly directional antennas with fixed pointing directions, can be employed as a low-cost solution to replace dynamic BF.",
        "labels": "CLN"
    },
    {
        "idx": 48,
        "text": "However, the performance gap between dynamic BF and fixed BF should be evaluated to justify the use of fixed BF in HSR mmWave communications.",
        "labels": "GAP"
    },
    {
        "idx": 48,
        "text": "In this paper, empirical studies are conducted based on the raw data obtained from extensive measurement campaigns.",
        "labels": "MTD"
    },
    {
        "idx": 48,
        "text": "Two classic environments in railway traffic are considered: the traditional train station and the HSR tunnel.",
        "labels": "MTD"
    },
    {
        "idx": 48,
        "text": "Analyses of the measurement results, including the received signal strength, power delay profile, root-mean-squared delay spread, and channel non-stationarity are presented.",
        "labels": "MTD"
    },
    {
        "idx": 48,
        "text": "Then, based on the measured data, we generalize the widely-used close-in (CI) free-space path loss (PL) model so that the generalized model can characterize the PL in the HSR tunnel with a higher accuracy.",
        "labels": "MTD"
    },
    {
        "idx": 48,
        "text": "Finally, the performance gap between perfect dynamic BF and fixed BF is evaluated based on the generalized model and the measured data.",
        "labels": "MTD"
    },
    {
        "idx": 48,
        "text": "Our results show that the average throughput of dynamic BF is only 4% higher than that of fixed BF in the HSR tunnel, but 21% higher in the train station when severe beam misalignment is present.",
        "labels": "RST"
    },
    {
        "idx": 49,
        "text": "Integrated sensing and communication (ISAC) has been envisioned as a solution to realize the sensing capability required for emerging applications in wireless networks.",
        "labels": "BAC"
    },
    {
        "idx": 49,
        "text": "For a mono-static ISAC transceiver, as signal transmission durations are typically much longer than the radar echo round-trip times, the radar returns are drowned by the strong residual self interference (SI) from the transmitter, despite adopting sufficient SI cancellation techniques before digital domain - a phenomenon termed the echo-miss problem.",
        "labels": "BAC"
    },
    {
        "idx": 49,
        "text": "A promising approach to tackle this problem involves the ISAC transceiver to be full-duplex (FD), and in this paper we jointly design the transmit and receive beamformers at the transceiver, transmit precoder at the uplink user, and receive combiner at the downlink user to simultaneously 1) maximize the uplink and downlink communication rate; 2) maximize the transmit and receive radar beampattern power at the target; and 3) suppress the residual SI.",
        "labels": "PUR"
    },
    {
        "idx": 49,
        "text": "To solve this optimization problem, we proposed a penalty-based iterative algorithm.",
        "labels": "MTD"
    },
    {
        "idx": 49,
        "text": "Numerical results illustrate that the proposed design can effectively achieve up to 60 dB digital-domain SI cancellation, a higher average sum-rate, and more accurate radar parameter estimation compared with previous ISAC FD studies.",
        "labels": "CLN"
    },
    {
        "idx": 50,
        "text": "Video conferencing has become a popular mode of meeting despite consuming considerable communication resources.",
        "labels": "BAC"
    },
    {
        "idx": 50,
        "text": "Conventional video compression causes resolution reduction under a limited bandwidth.",
        "labels": "BAC"
    },
    {
        "idx": 50,
        "text": "Semantic video conferencing (SVC) maintains a high resolution by transmitting some keypoints to represent the motions because the background is almost static, and the speakers do not change often.",
        "labels": "BAC"
    },
    {
        "idx": 50,
        "text": "However, the study on the influence of transmission errors on keypoints is limited.",
        "labels": "GAP"
    },
    {
        "idx": 50,
        "text": "In this paper, an SVC network based on keypoint transmission is established, which dramatically reduces transmission resources while only losing detailed expressions.",
        "labels": "PUR"
    },
    {
        "idx": 50,
        "text": "Transmission errors in SVC only lead to a changed expression, whereas those in the conventional methods directly destroy pixels.",
        "labels": "GAP"
    },
    {
        "idx": 50,
        "text": "However, the conventional error detector, such as cyclic redundancy check, cannot reflect the degree of expression changes.",
        "labels": "GAP"
    },
    {
        "idx": 50,
        "text": "To overcome this issue, an incremental redundancy hybrid automatic repeat-request framework for varying channels (SVC-HARQ) incorporating a novel semantic error detector is developed.",
        "labels": "PUR"
    },
    {
        "idx": 50,
        "text": "SVC-HARQ has flexibility in bit consumption and achieves a good performance.",
        "labels": "BAC"
    },
    {
        "idx": 50,
        "text": "In addition, SVC-channel state information (CSI) is designed for CSI feedback to allocate the keypoint transmission and enhance the performance dramatically.",
        "labels": "MTD"
    },
    {
        "idx": 50,
        "text": "Simulation shows that the proposed wireless semantic communication system can remarkably improve transmission efficiency.",
        "labels": "CLN"
    },
    {
        "idx": 51,
        "text": "In this paper, intelligent reflecting surfaces (IRSs) are employed to enhance the physical layer security in a challenging radio environment.",
        "labels": "PUR"
    },
    {
        "idx": 51,
        "text": "In particular, a multi-antenna access point (AP) has to serve multiple single-antenna legitimate users, which do not have line-of-sight communication links, in the presence of multiple multi-antenna potential eavesdroppers whose channel state information (CSI) is not perfectly known.",
        "labels": "BAC"
    },
    {
        "idx": 51,
        "text": "Artificial noise (AN) is transmitted from the AP to deliberately impair the eavesdropping channels for security provisioning.",
        "labels": "BAC"
    },
    {
        "idx": 51,
        "text": "We investigate the joint design of the beamformers and AN covariance matrix at the AP and the phase shifters at the IRSs for maximization of the system sum-rate while limiting the maximum information leakage to the potential eavesdroppers.",
        "labels": "PUR"
    },
    {
        "idx": 51,
        "text": "To this end, we formulate a robust non-convex optimization problem taking into account the impact of the imperfect CSI of the eavesdropping channels.",
        "labels": "MTD"
    },
    {
        "idx": 51,
        "text": "To address the non-convexity of the optimization problem, an efficient algorithm is developed by capitalizing on alternating optimization, a penalty-based approach, successive convex approximation, and semidefinite relaxation.",
        "labels": "MTD"
    },
    {
        "idx": 51,
        "text": "Simulation results show that IRSs can significantly improve the system secrecy performance compared to conventional architectures without IRS.",
        "labels": "RST"
    },
    {
        "idx": 51,
        "text": "Furthermore, our results unveil that, for physical layer security, uniformly distributing the reflecting elements among multiple IRSs is preferable over deploying them at a single IRS.",
        "labels": "CLN"
    },
    {
        "idx": 52,
        "text": "Sparse signal recovery problems from noisy linear measurements appear in many areas of wireless communications.",
        "labels": "BAC"
    },
    {
        "idx": 52,
        "text": "In recent years, deep learning (DL) based approaches have attracted interests of researchers to solve the sparse linear inverse problem by unfolding iterative algorithms as neural networks.",
        "labels": "BAC"
    },
    {
        "idx": 52,
        "text": "Typically, research concerning DL assume a fixed number of network layers.",
        "labels": "BAC"
    },
    {
        "idx": 52,
        "text": "However, it ignores a key character in traditional iterative algorithms, where the number of iterations required for convergence changes with varying sparsity levels.",
        "labels": "GAP"
    },
    {
        "idx": 52,
        "text": "By investigating on the projected gradient descent, we unveil the drawbacks of the existing DL methods with fixed depth.",
        "labels": "MTD"
    },
    {
        "idx": 52,
        "text": "Then we propose an end-to-end trainable DL architecture, which involves an extra halting score at each layer.",
        "labels": "MTD"
    },
    {
        "idx": 52,
        "text": "Therefore, the proposed method learns how many layers to execute to emit an output, and the network depth is dynamically adjusted for each task in the inference phase.",
        "labels": "MTD"
    },
    {
        "idx": 52,
        "text": "We conduct experiments using both synthetic data and applications including random access in massive MTC and massive MIMO channel estimation, and the results demonstrate the improved efficiency for the proposed approach.",
        "labels": "MTD"
    },
    {
        "idx": 53,
        "text": "A crucial step towards the 6th generation (6G) of networks would be a shift in communication paradigm beyond the limits of Shannon’s theory.",
        "labels": "BAC"
    },
    {
        "idx": 53,
        "text": "In both classical and quantum Shannon’s information theory, communication channels are generally assumed to combine through classical trajectories, so that the associated network path traversed by the information carrier is well-defined.",
        "labels": "BAC"
    },
    {
        "idx": 53,
        "text": "Counter-intuitively, quantum mechanics enables a quantum information carrier to propagate through a quantum path, i.e., through a path such that the causal order of the constituting communications channels becomes indefinite.",
        "labels": "BAC"
    },
    {
        "idx": 53,
        "text": "Quantum paths exhibit astonishing features, such as providing non-null capacity even when no information can be sent through any classical path.",
        "labels": "BAC"
    },
    {
        "idx": 53,
        "text": "In this paper, we study the quantum capacity achievable via a quantum path and establish upper and the lower bounds for it.",
        "labels": "PUR"
    },
    {
        "idx": 53,
        "text": "Our findings reveal the substantial advantage achievable with a quantum path over any classical placements of communications channels in terms of ultimate achievable communication rates.",
        "labels": "CLN"
    },
    {
        "idx": 53,
        "text": "Furthermore, we identify the region where a quantum path incontrovertibly outperforms the amount of transmissible information beyond the limits of conventional quantum Shannon’s theory, and we quantify this advantage over classical paths through a conservative estimate.",
        "labels": "MTD"
    },
    {
        "idx": 54,
        "text": "In the coming smart ocean era, reliable and efficient communications are crucial for promoting a variety of maritime activities.",
        "labels": "BAC"
    },
    {
        "idx": 54,
        "text": "Current maritime communication networks (MCNs) mainly rely on marine satellites and on-shore base stations (BSs).",
        "labels": "BAC"
    },
    {
        "idx": 54,
        "text": "The former generally provides limited transmission rate, while the latter lacks wide-area coverage capability.",
        "labels": "GAP"
    },
    {
        "idx": 54,
        "text": "Due to these facts, the state-of-the-art MCN falls far behind terrestrial fifth-generation (5G) networks.",
        "labels": "GAP"
    },
    {
        "idx": 54,
        "text": "To fill up the gap in the coming sixth-generation (6G) era, we explore the benefit of deployable BSs for maritime coverage enhancement.",
        "labels": "PUR"
    },
    {
        "idx": 54,
        "text": "Both unmanned aerial vehicles (UAVs) and mobile vessels are used to configure deployable BSs.",
        "labels": "MTD"
    },
    {
        "idx": 54,
        "text": "This leads to a hierarchical satellite-UAV-terrestrial network on the ocean.",
        "labels": "BAC"
    },
    {
        "idx": 54,
        "text": "We address the joint link scheduling and rate adaptation problem for this hybrid network, to minimize the total energy consumption with quality of service (QoS) guarantees.",
        "labels": "PUR"
    },
    {
        "idx": 54,
        "text": "Different from previous studies, we use only the large-scale channel state information (CSI), which is location-dependent and thus can be predicted through the position information of each UAV/vessel based on its specific trajectory/shipping lane.",
        "labels": "MTD"
    },
    {
        "idx": 54,
        "text": "The problem is shown to be an NP-hard mixed integer nonlinear programming problem with a group of hidden non-linear equality constraints.",
        "labels": "MTD"
    },
    {
        "idx": 54,
        "text": "We solve it suboptimally by using Min-Max transformation and iterative problem relaxation, leading to a process-oriented joint link scheduling and rate adaptation scheme.",
        "labels": "MTD"
    },
    {
        "idx": 54,
        "text": "As observed by simulations, the scheme can provide agile on-demand coverage for all users with much reduced system overhead and a polynomial computation complexity.",
        "labels": "RST"
    },
    {
        "idx": 54,
        "text": "Moreover, it can achieve a prominent performance close to the optimal solution.",
        "labels": "RST"
    },
    {
        "idx": 55,
        "text": "The maturity of the 5th-Generation (5G) communication technology promotes a new round of industrial revolution and supports the high-quality development of economic society.",
        "labels": "BAC"
    },
    {
        "idx": 55,
        "text": "However, owing to the scarce communication resources, costly labor and complex geographic environment, inspecting and maintaining electrical faults accurately and timely in a remote grid is rather challenging.",
        "labels": "GAP"
    },
    {
        "idx": 55,
        "text": "To solve this problem, we comprehensively consider secure and efficient signal transmissions to construct an automatic grid fault inspection system and formulate a multi-objective optimization problem.",
        "labels": "PUR"
    },
    {
        "idx": 55,
        "text": "Due to its complexity, we decompose it into two sub-problems, propose a blockchain-enabled secure transmission scheme (BEST) and an improved market matching (IMM) algorithm, correspondingly.",
        "labels": "MTD"
    },
    {
        "idx": 55,
        "text": "Considering the latency magnitude difference between blockchain verification and intra-domain transmission, the BEST scheme integrates deep reinforcement learning-based improved proximal policy optimization training algorithm (DRIP) and A*-based bi-objective multi-destination optimization algorithm (ABOO) to achieve the intra-domain secure transmission.",
        "labels": "MTD"
    },
    {
        "idx": 55,
        "text": "Based on the real city topology and the YouTube video service data statistics, our algorithms can optimize the network performance while guaranteeing the security of signal transmissions.",
        "labels": "MTD"
    },
    {
        "idx": 56,
        "text": "In this paper, we study the physical-layer security in a 3-D multiuser visible light communication (VLC) network.",
        "labels": "PUR"
    },
    {
        "idx": 56,
        "text": "The locations of access points (APs) and mobile users are modeled as two 2-D, independent and homogeneous Poisson point processes at distinct heights.",
        "labels": "MTD"
    },
    {
        "idx": 56,
        "text": "Using mathematical tools from stochastic geometry, we provide a new analytical framework to characterize the secrecy performance in multiuser VLC networks.",
        "labels": "PUR"
    },
    {
        "idx": 56,
        "text": "Closed-form results for the outage probability and the ergodic secrecy rate are derived for networks without AP cooperation.",
        "labels": "MTD"
    },
    {
        "idx": 56,
        "text": "Considering the cooperation among APs, we give tight lower and upper bounds on the secrecy outage probability and the ergodic secrecy rate.",
        "labels": "MTD"
    },
    {
        "idx": 56,
        "text": "To further enhance the secrecy performance at the legitimate user, a disk-shaped secrecy protected zone is implemented in the vicinity of the transmit AP.",
        "labels": "MTD"
    },
    {
        "idx": 56,
        "text": "Based on the obtained results, it is shown that cooperating neighboring APs in a multiuser VLC network can bring performance gains on the secrecy rate, but only to a limited extent.",
        "labels": "RST"
    },
    {
        "idx": 56,
        "text": "We also show that building an eavesdropper-free protected zone around the AP significantly improves the secrecy performance of legitimate users, which appears to be a promising solution for the design of multiuser VLC networks with high security requirements.",
        "labels": "CLN"
    },
    {
        "idx": 57,
        "text": "In fifth generation (5G) and beyond Internet of Things (IoT), it becomes increasingly important to serve a massive number of IoT devices outside the coverage of terrestrial cellular networks.",
        "labels": "BAC"
    },
    {
        "idx": 57,
        "text": "Due to their own limitations, unmanned aerial vehicles (UAVs) and satellites need to coordinate with each other in the coverage holes of 5G, leading to a cognitive satellite-UAV network (CSUN).",
        "labels": "GAP"
    },
    {
        "idx": 57,
        "text": "In this paper, we investigate multi-domain resource allocation for CSUNs consisting of a satellite and a swarm of UAVs, so as to improve the efficiency of massive access in wide areas.",
        "labels": "PUR"
    },
    {
        "idx": 57,
        "text": "Particularly, the cell-free on-demand coverage is established to overcome the cost-ineffectiveness of conventional cellular architecture.",
        "labels": "MTD"
    },
    {
        "idx": 57,
        "text": "Opportunistic spectrum sharing is also implemented to cope with the spectrum scarcity problem.",
        "labels": "MTD"
    },
    {
        "idx": 57,
        "text": "To this end, a process-oriented optimization framework is proposed for jointly allocating subchannels, transmit power and hovering times, which considers the whole flight process of UAVs and uses only the slowly-varying large-scale channel state information (CSI).",
        "labels": "MTD"
    },
    {
        "idx": 57,
        "text": "Under the on-board energy constraints of UAVs and interference temperature constraints from UAV swarm to satellite users, we present iterative multi-domain resource allocation algorithms to improve network efficiency with guaranteed user fairness.",
        "labels": "MTD"
    },
    {
        "idx": 57,
        "text": "Simulation results demonstrate the superiority of the proposed algorithms.",
        "labels": "CLN"
    },
    {
        "idx": 57,
        "text": "Moreover, the adaptive cell-free coverage pattern is observed, which implies a promising way to efficiently serve wide-area IoT devices in the upcoming sixth generation (6G) era.",
        "labels": "CLN"
    },
    {
        "idx": 58,
        "text": "Dual-function radar-communication (DFRC), which can simultaneously perform both radar and communication functionalities using the same hardware platform, spectral resource and transmit waveform, is a promising technique for realizing integrated sensing and communication (ISAC).",
        "labels": "BAC"
    },
    {
        "idx": 58,
        "text": "Space-time adaptive processing (STAP) in multi-antenna radar systems is the primary tool for detecting moving targets in the presence of strong clutter.",
        "labels": "BAC"
    },
    {
        "idx": 58,
        "text": "The idea of joint spatial-temporal optimization in STAP-based radar systems is consistent with the concept of symbol-level precoding (SLP) for multi-input multi-output (MIMO) communications, which optimizes the transmit waveform for each of the transmitted symbols.",
        "labels": "BAC"
    },
    {
        "idx": 58,
        "text": "In this paper, we combine STAP and SLP and propose a novel STAP-SLP-based DFRC system that enjoys the advantages of both techniques.",
        "labels": "PUR"
    },
    {
        "idx": 58,
        "text": "The radar output signal-to-interference-plus-noise ratio (SINR) is maximized by jointly optimizing the transmit waveform and receive filter, while satisfying the communication quality-of-service (QoS) constraint and various waveform constraints including constant-modulus, similarity and peak-to-average power ratio (PAPR).",
        "labels": "BAC"
    },
    {
        "idx": 58,
        "text": "An efficient algorithm framework based on majorization-minimization (MM) and nonlinear equality constrained alternative direction method of multipliers (neADMM) methods is proposed to solve these complicated non-convex optimization problems.",
        "labels": "MTD"
    },
    {
        "idx": 58,
        "text": "Simulation results verify the effectiveness of the proposed STAP-SLP-based MIMO-DRFC scheme and the associate algorithms.",
        "labels": "CLN"
    },
    {
        "idx": 59,
        "text": "In a device-to-device (D2D) communications underlaying cellular network, any user is a potential eavesdropper for the transmissions of others that occupy the same spectrum.",
        "labels": "BAC"
    },
    {
        "idx": 59,
        "text": "The physical-layer security mechanism of theoretical secure capacity, which maximizes the rate of reliable communication from the source user to the legitimate receiver and ensure unauthorized users learn as little as information as possible, is typically employed to guarantee secure communications.",
        "labels": "BAC"
    },
    {
        "idx": 59,
        "text": "As hand-held devices are carried by human beings, we may leverage their social trust to decrease the number of potential eavesdroppers.",
        "labels": "BAC"
    },
    {
        "idx": 59,
        "text": "Aiming to establish a new paradigm for solving the challenging problem of security and efficiency tradeoff, we propose a social trust-aware D2D communication architecture that exploits the social-domain trust for securing the physical-domain communication.",
        "labels": "PUR"
    },
    {
        "idx": 59,
        "text": "In order to understand the impact of social trust on the security of transmissions, we analyze the system ergodic rate of social trust aided communications via stochastic geometry, and our result based on a real data set shows that the proposed social trust aided D2D communication increases the system secrecy rate by about 63% compared with the scheme without considering social trust relation.",
        "labels": "MTD"
    },
    {
        "idx": 59,
        "text": "Furthermore, in order to provide implementation mechanism, we utilize matching theory to implement efficient resource allocation among multiple users.",
        "labels": "MTD"
    },
    {
        "idx": 59,
        "text": "Numerical results show that our proposed mechanism increases the system secrecy rate by 28% with fast convergence over the social oblivious approach.",
        "labels": "RST"
    },
    {
        "idx": 60,
        "text": "Satellite communication systems are able to provide diverse services for ground terminals in ubiquitous global coverage, which play a vital role in high-mobility communication environments.",
        "labels": "BAC"
    },
    {
        "idx": 60,
        "text": "Existing technologies developed primarily for satellite communications cannot be readily applied to satellite high-mobility communication scenarios, since high Doppler frequency offset caused by the fast movement of wireless terminals, and low signal-to-noise ratio (SNR) circumstances caused by limited link budgets in satellites incur more difficulty of the synchronization, especially for short burst transmission.",
        "labels": "GAP"
    },
    {
        "idx": 60,
        "text": "To solve such a problem in satellite high-mobility communications, we propose a novel method named GP-MASO-MLE, which consists of a coarse estimation algorithm based on the Gaussian process (GP) model and Newton-Raphson method, and a fine correction algorithm based on the improved maximum likelihood estimation (MLE) jointly with turbo decoding iterations.",
        "labels": "PUR"
    },
    {
        "idx": 60,
        "text": "Simulation results show that the proposed algorithm can approach to the bit error rate (BER) performance bound of ideal Doppler frequency offset correction within 0.1 dB, which can be well applied in code-aided (CA) satellite high-mobility communication systems for its good performance.",
        "labels": "CLN"
    },
    {
        "idx": 60,
        "text": "In addition, the computational complexity of the proposed algorithm is lower than other traditional turbo synchronization algorithms.",
        "labels": "CLN"
    },
    {
        "idx": 61,
        "text": "In this paper, we present a centralized method for real-time rainfall estimation using carrier-to-noise power ratio ( $C/N$ ) measurements from broadband satellite communication networks.",
        "labels": "PUR"
    },
    {
        "idx": 61,
        "text": "The $C/N$ data of both forward link and return link are collected by the gateway station from the user terminals in the broadband satellite communication network and stored in a database.",
        "labels": "MTD"
    },
    {
        "idx": 61,
        "text": "The $C/N$ for such Ka-band scenarios is impaired mainly by the rainfall.",
        "labels": "BAC"
    },
    {
        "idx": 61,
        "text": "Using signal processing and machine learning techniques, we develop an algorithm for real-time rainfall estimation.",
        "labels": "MTD"
    },
    {
        "idx": 61,
        "text": "Extracting relevant features from $C/N$ , we use artificial neural network in order to distinguish the rain events from dry events.",
        "labels": "MTD"
    },
    {
        "idx": 61,
        "text": "Extracting relevant features from $C/N$ , we use artificial neural network in order to distinguish the rain events from dry events. ",
        "labels": "MTD"
    },
    {
        "idx": 61,
        "text": "We then determine the signal attenuation corresponding to the rain events and examine an empirical relationship between rainfall rate and signal attenuation.",
        "labels": "MTD"
    },
    {
        "idx": 61,
        "text": "Experimental results are promising and prove the high potential of satellite communication links for real environment monitoring, particularly rainfall estimation.",
        "labels": "CLN"
    },
    {
        "idx": 62,
        "text": "The paper is the first work that considers a constrained feedback control strategy to navigate an unmanned aerial vehicle (UAV) from a given starting point to a given terminal point while harvesting solar energy and providing a wireless communication service for ground users.",
        "labels": "PUR"
    },
    {
        "idx": 62,
        "text": "Wireless communication channels are stochastic and cannot be known off-line, making the problem of off-line UAV path planning for wireless communication as considered in most existing works less meaningful.",
        "labels": "GAP"
    },
    {
        "idx": 62,
        "text": "We consider the problem of navigating a solar-powered UAV from a starting point to a terminal point to harvest solar energy while serving the two-way communication between multiple pairs of ground users in a complex terrain.",
        "labels": "MTD"
    },
    {
        "idx": 62,
        "text": "The objective is to jointly optimize the UAV’s flight time and its flight path by trading-off between the harvested energy and power consumption subject to the ground users’ minimum throughput requirement.",
        "labels": "MTD"
    },
    {
        "idx": 62,
        "text": "We develop a new model predictive control (MPC) technique to address this problem.",
        "labels": "MTD"
    },
    {
        "idx": 62,
        "text": "Namely, based on the well-known statistics of the air-to-ground (A2G) and ground-to-air (G2A) wireless channels, a predictive control model is proposed at each time-instant, which leads to an optimization problem over a receding horizon for the control design.",
        "labels": "MTD"
    },
    {
        "idx": 62,
        "text": "This problem is non-convex due to the involvement of various optimization variables, which is then solved via novel convex iterations.",
        "labels": "MTD"
    },
    {
        "idx": 62,
        "text": "Simulation results show the merits of the proposed algorithm.",
        "labels": "CLN"
    },
    {
        "idx": 62,
        "text": "The results obtained by the proposed algorithm match with the benchmark non-MPC and offline-MPC approaches.",
        "labels": "CLN"
    },
    {
        "idx": 63,
        "text": "This article presents a protection method for controller area network (CAN) communication against electromagnetic interference (EMI) caused by switched-mode power supplies (SMPSs).",
        "labels": "PUR"
    },
    {
        "idx": 63,
        "text": "SMPSs generate EMI noise on the communication lines by switching the power semiconductor devices, which often causes communication failure.",
        "labels": "BAC"
    },
    {
        "idx": 63,
        "text": "Conventional EMI reduction methods, such as EMI filters and shielded cables, generally reduce the converter conducted noise and the noise susceptibility of the communication system.",
        "labels": "BAC"
    },
    {
        "idx": 63,
        "text": "However, depending on the system configuration, these EMI reduction methods are not sufficient to prevent communication failure.",
        "labels": "GAP"
    },
    {
        "idx": 63,
        "text": "To resolve this issue, the authors propose an EMI failure protection method that realizes robust CAN operation.",
        "labels": "PUR"
    },
    {
        "idx": 63,
        "text": "The proposed method eliminates the coincidence between induced noise in the communication lines and the CAN sample timing so that no communication failure occurs.",
        "labels": "MTD"
    },
    {
        "idx": 63,
        "text": "Experimental results verify that the proposed method is effective in interference reduction, and the proposed method is revised for resolving the converter output disturbance due to an undesirable shift of switching timing.",
        "labels": "CLN"
    },
    {
        "idx": 64,
        "text": "Wireless communication enabled by unmanned aerial vehicles (UAVs) has emerged as an appealing technology for many application scenarios in future wireless systems.",
        "labels": "BAC"
    },
    {
        "idx": 64,
        "text": "However, the limited endurance of UAVs greatly hinders the practical implementation of UAV-enabled communications.",
        "labels": "GAP"
    },
    {
        "idx": 64,
        "text": "To overcome this issue, this paper proposes a novel scheme for UAV-enabled communications by utilizing the promising technique of proactive caching at the users.",
        "labels": "PUR"
    },
    {
        "idx": 64,
        "text": "Specifically, we focus on content-centric communication systems, where a UAV is dispatched to serve a group of ground nodes (GNs) with random and asynchronous requests for files drawn from a given set.",
        "labels": "MTD"
    },
    {
        "idx": 64,
        "text": "With the proposed scheme, at the beginning of each operation period, the UAV pro-actively transmits the files to a subset of selected GNs that cooperatively cache all the files.",
        "labels": "MTD"
    },
    {
        "idx": 64,
        "text": "As a result, when requested, a file can be retrieved by each GN either directly from its local cache or from its nearest neighbor that has cached the file via device-to-device communications.",
        "labels": "MTD"
    },
    {
        "idx": 64,
        "text": "It is revealed that there exists a fundamental trade-off between the file caching cost, which is the total time required for the UAV to transmit the files to their designated caching GNs, and the file retrieval cost, which is the average time required for serving one file request.",
        "labels": "MTD"
    },
    {
        "idx": 64,
        "text": "To characterize this trade-off, we formulate an optimization problem to minimize the weighted sum of the two costs, via jointly designing the file caching policy, the UAV trajectory, and communication scheduling.",
        "labels": "MTD"
    },
    {
        "idx": 64,
        "text": "As the formulated problem is NP-hard in general, we propose efficient algorithms to find high-quality approximate solutions for it.",
        "labels": "MTD"
    },
    {
        "idx": 64,
        "text": "Numerical results are provided to corroborate our study and show the great potential of proactive caching for overcoming the endurance issue in UAV-enabled communications.",
        "labels": "CLN"
    },
    {
        "idx": 65,
        "text": "Global navigation satellite system (GNSS) is not suitable for the dense urban or indoor environments as the satellite signals are very weak.",
        "labels": "BAC"
    },
    {
        "idx": 65,
        "text": "Meanwhile, positioning is an important application of the fifth-generation (5G) communication system.",
        "labels": "BAC"
    },
    {
        "idx": 65,
        "text": "GNSS/5G integrated positioning system becomes a promising research topic with the development of 5G standard.",
        "labels": "BAC"
    },
    {
        "idx": 65,
        "text": "This paper focuses on the integrated methodology of GNSS and device to device (D2D) measurements in 5G communication system.",
        "labels": "PUR"
    },
    {
        "idx": 65,
        "text": "We analyze the characteristics of this type of integrated system and propose a high-efficiency D2D positioning measure protocol, named crossover multiple-way ranging, which consumes less communication resources.",
        "labels": "MTD"
    },
    {
        "idx": 65,
        "text": "Then, to deal with the high-dimensional state space in the integrated system, a state dimension reduction method is proposed to overcome the particle degeneracy problem of particle filter which is used to fusion GNSS and 5G D2D measurements.",
        "labels": "MTD"
    },
    {
        "idx": 65,
        "text": "Three integrated algorithms in different scenarios have been proposed: the first one is the integrated algorithm when the range measurements can be measured directly.",
        "labels": "MTD"
    },
    {
        "idx": 65,
        "text": "The second one is the integrated algorithm with unknown time skew and offset of each mobile terminal.",
        "labels": "MTD"
    },
    {
        "idx": 65,
        "text": "The third one is the integrated algorithm in GNSS-denied environment which is prevalent in urban and indoor applications.",
        "labels": "MTD"
    },
    {
        "idx": 65,
        "text": "The simulation and experimental results show that our proposed integrated methodology outperforms the nonintegrated one.",
        "labels": "CLN"
    },
    {
        "idx": 66,
        "text": "Networked finite state machine takes into account communication losses in industrial communication interfaces due to the limited bandwidth.",
        "labels": "BAC"
    },
    {
        "idx": 66,
        "text": "The reachability analysis of networked finite state machine is a fundamental and important research topic in blocking detection, safety analysis, communication system design and so on.",
        "labels": "BAC"
    },
    {
        "idx": 66,
        "text": "This paper is concerned with the impact of arbitrary communication losses on the reachability of networked finite state machine from a switched perspective.",
        "labels": "PUR"
    },
    {
        "idx": 66,
        "text": "First, to model the dynamics under arbitrary communication losses in communication interfaces (from the controller to the actuator), by resorting to the semi-tensor product (STP) of matrices, a switched algebraic model of networked finite state machine with arbitrary communication losses is proposed, and the reachability analysis can be investigated by using the constructed model under arbitrary switching signal.",
        "labels": "MTD"
    },
    {
        "idx": 66,
        "text": "Subsequently, based on the algebraic expression and its transition matrix, necessary and sufficient conditions for the reachability are derived for networked finite state machine.",
        "labels": "MTD"
    },
    {
        "idx": 66,
        "text": "Finally, some typical numerical examples are exploited to demonstrate the effectiveness of the proposed approach.",
        "labels": "MTD"
    },
    {
        "idx": 66,
        "text": "Note that current results provide valuable clues to design reliable and convergent Internet-of-Things networks.",
        "labels": "IMP"
    },
    {
        "idx": 67,
        "text": "The electricity costs of the Utilities are increased with the deviations from the forecasted demand, which are caused by forecast errors and demand fluctuations.",
        "labels": "BAC"
    },
    {
        "idx": 67,
        "text": "The forecast errors are deterministic and can be avoided by the Utilities with long-term operations in electricity markets, whereas the demand fluctuations are stochastic and unavoidable.",
        "labels": "BAC"
    },
    {
        "idx": 67,
        "text": "Demand response can be used for mitigating the demand fluctuations by measuring the electricity usage of consumers and publishing control commands periodically.",
        "labels": "BAC"
    },
    {
        "idx": 67,
        "text": "The performance of demand response is dependent on the quality of communications between the control center and the consumers.",
        "labels": "BAC"
    },
    {
        "idx": 67,
        "text": "The two-way communications are established based on the data aggregator units (DAU) deployed by the Utilities.",
        "labels": "BAC"
    },
    {
        "idx": 67,
        "text": "To improve the quality of communications, we utilize the base stations in telecom networks to forward the metering and control data for the DAUs.",
        "labels": "PUR"
    },
    {
        "idx": 67,
        "text": "The telecom operators maximize their profits and decide the fractions of transmission power allocated for relaying, and then the Utilities select the payments to obtain the corresponding transmission power allocated for relaying.",
        "labels": "MTD"
    },
    {
        "idx": 67,
        "text": "We characterize the electricity costs of the Utilities based on Taguchi loss function and establish a Stackelberg game between the telecom operators and the Utilities.",
        "labels": "MTD"
    },
    {
        "idx": 67,
        "text": "We prove the existence and uniqueness of Nash equilibrium for the follower-level payment selection game and develop an iterative algorithm to search for the equilibrium.",
        "labels": "CLN"
    },
    {
        "idx": 67,
        "text": "Then, the Stackelberg equilibrium can be obtained by a backward induction method.",
        "labels": "MTD"
    },
    {
        "idx": 67,
        "text": "Numerical results show that the cost of the Utilities can be reduced and the profits of the telecom operators are increased.",
        "labels": "CLN"
    },
    {
        "idx": 68,
        "text": "Ultra-dense low-Earth-orbit (LEO) satellite communication networks have significant potential for providing high-speed data services.",
        "labels": "BAC"
    },
    {
        "idx": 68,
        "text": "To compensate the severe path loss in satellite communications, a key conceptual enabler is the holographic multiple input multiple output (HMIMO) with a spatially continuous aperture which can achieve a high directive gain with a small antenna size.",
        "labels": "BAC"
    },
    {
        "idx": 68,
        "text": "In this paper, we consider a novel metamaterial antenna called a reconfigurable holographic surface (RHS) integrated with a user terminal (UT) to support LEO satellite communications.",
        "labels": "PUR"
    },
    {
        "idx": 68,
        "text": "Composing of densely packing sub-wavelength metamaterial elements, the RHS can realize continuous or quasi-continuous apertures and provide a practical way towards the implementation of HMIMO.",
        "labels": "MTD"
    },
    {
        "idx": 68,
        "text": "To obtain the desired beam directions towards the satellites, we propose a LEO satellite tracking scheme based on the temporal variation law such that frequent satellite positioning can be avoided.",
        "labels": "MTD"
    },
    {
        "idx": 68,
        "text": "A holographic beamforming algorithm for sum rate maximization is then developed where a closed-form for the optimal holographic beamformer is derived.",
        "labels": "MTD"
    },
    {
        "idx": 68,
        "text": "The robustness of the algorithm against the tracking errors of the satellites’ positions is also proved.",
        "labels": "MTD"
    },
    {
        "idx": 68,
        "text": "Simulation results verify the theoretical analysis and show that the RHS outperforms the traditional phased array of the same physical dimension in terms of the sum rate when the compact element spacing of the RHS leads to much more RHS elements.",
        "labels": "CLN"
    },
    {
        "idx": 68,
        "text": "Moreover, the RHS also provides a more cost-effective solution for pursuing high data rate compared with the phased array.",
        "labels": "CLN"
    },
    {
        "idx": 69,
        "text": "Task-oriented communications, mostly using learning-based joint source-channel coding (JSCC), aim to design a communication-efficient edge inference system by transmitting task-relevant information to the receiver.",
        "labels": "BAC"
    },
    {
        "idx": 69,
        "text": "However, only transmitting task-relevant information without introducing any redundancy may cause robustness issues in learning due to the channel variations, and the JSCC which directly maps the source data into continuous channel input symbols poses compatibility issues on existing digital communication systems.",
        "labels": "GAP"
    },
    {
        "idx": 69,
        "text": "In this paper, we address these two issues by first investigating the inherent tradeoff between the informativeness of the encoded representations and the robustness to information distortion in the received representations, and then propose a task-oriented communication scheme with digital modulation, named discrete task-oriented JSCC (DT-JSCC), where the transmitter encodes the features into a discrete representation and transmits it to the receiver with the digital modulation scheme.",
        "labels": "PUR"
    },
    {
        "idx": 69,
        "text": "In the DT-JSCC scheme, we develop a robust encoding framework, named robust information bottleneck (RIB), to improve the communication robustness to the channel variations, and derive a tractable variational upper bound of the RIB objective function using the variational approximation to overcome the computational intractability of mutual information.",
        "labels": "MTD"
    },
    {
        "idx": 69,
        "text": "The experimental results demonstrate that the proposed DT-JSCC achieves better inference performance than the baseline methods with low communication latency, and exhibits robustness to channel variations due to the applied RIB framework.",
        "labels": "CLN"
    },
    {
        "idx": 70,
        "text": "Unmanned aerial vehicle (UAV) technology is recognized as a promising solution to area coverage problems (ACPs) and has been extensively studied recently.",
        "labels": "BAC"
    },
    {
        "idx": 70,
        "text": "In this paper, we study the 3D irregular terrain surface coverage problem with a hierarchical UAV swarm.",
        "labels": "PUR"
    },
    {
        "idx": 70,
        "text": "We first build the 3D model of a random irregular terrain and propose a geometric way to project the 3D terrain surface into many weighted 2D patches.",
        "labels": "MTD"
    },
    {
        "idx": 70,
        "text": "Then we develop a two-level hierarchical UAV swarm architecture, including the low-level follower UAVs (FUAVs) and the high-level leader UAVs (LUAVs).",
        "labels": "MTD"
    },
    {
        "idx": 70,
        "text": "For FUAVs, we design a coverage trajectory algorithm to carry out specific coverage tasks within patches based on the star communication topology.",
        "labels": "MTD"
    },
    {
        "idx": 70,
        "text": "For LUAVs, we propose a swarm deep Q-learning (SDQN) reinforcement learning algorithm to select patches.",
        "labels": "MTD"
    },
    {
        "idx": 70,
        "text": "Moreover, an observation history model based on convolutional neural networks (CNNs) and the mean embedding method is integrated into SDQN to address the communication limitation problems of LUAVs.",
        "labels": "MTD"
    },
    {
        "idx": 70,
        "text": "The numerical results show that FUAVs can cover the entire area of each patch with little redundancies, and the total coverage time of the SDQN is less than that of existing methods, which demonstrates the effectiveness of the proposed algorithms.",
        "labels": "RST"
    },
    {
        "idx": 71,
        "text": "Antenna arrays have a long history of more than 100 years and have evolved closely with the development of electronic and information technologies, playing an indispensable role in wireless communications and radar.",
        "labels": "BAC"
    },
    {
        "idx": 71,
        "text": "With the rapid development of electronic and information technologies, the demand for all-time, all-domain, and full-space network services has exploded, and new communication requirements have been put forward on various space/air/ground platforms.",
        "labels": "BAC"
    },
    {
        "idx": 71,
        "text": "To meet the ever increasing requirements of the future sixth generation (6G) wireless communications, such as high capacity, wide coverage, low latency, and strong robustness, it is promising to employ different types of antenna arrays (e.g., phased arrays, digital arrays, and reconfigurable intelligent surfaces, etc.) with various beamforming technologies (e.g., analog beamforming, digital beamforming, hybrid beamforming, and passive beamforming, etc.) in space/air/ground communication networks, bringing in advantages such as considerable antenna gains, multiplexing gains, and diversity gains.",
        "labels": "BAC"
    },
    {
        "idx": 71,
        "text": "However, enabling antenna array for space/air/ground communication networks poses specific, distinctive and tricky challenges, which has aroused extensive research attention.",
        "labels": "GAP"
    },
    {
        "idx": 71,
        "text": "This paper aims to overview the field of antenna array enabled space/air/ground communications and networking.",
        "labels": "PUR"
    },
    {
        "idx": 71,
        "text": "The technical potentials and challenges of antenna array enabled space/air/ground communications and networking are presented first.",
        "labels": "MTD"
    },
    {
        "idx": 71,
        "text": "Subsequently, the antenna array structures and designs are discussed.",
        "labels": "MTD"
    },
    {
        "idx": 71,
        "text": "We then discuss various emerging technologies facilitated by antenna arrays to meet the new communication requirements of space/air/ground communication systems.",
        "labels": "MTD"
    },
    {
        "idx": 71,
        "text": "Enabled by these emerging technologies, the distinct characteristics, challenges, and solutions for space communications, airborne communications, and ground communications are reviewed.",
        "labels": "MTD"
    },
    {
        "idx": 71,
        "text": "Finally, we present promising directions for future research in antenna array enabled space/air/ground communications and networking.",
        "labels": "MTD"
    },
    {
        "idx": 72,
        "text": "Communication has been known to be one of the primary bottlenecks of federated learning (FL), and yet existing studies have not addressed the efficient communication design, particularly in wireless FL where both uplink and downlink communications have to be considered.",
        "labels": "GAP"
    },
    {
        "idx": 72,
        "text": "In this paper, we focus on the design and analysis of physical layer quantization and transmission methods for wireless FL.",
        "labels": "PUR"
    },
    {
        "idx": 72,
        "text": "We answer the question of what and how to communicate between clients and the parameter server and evaluate the impact of the various quantization and transmission options of the updated model on the learning performance.",
        "labels": "MTD"
    },
    {
        "idx": 72,
        "text": "We provide new convergence analysis of the well-known FED AVG under non-i.i.d. dataset distributions, partial clients participation, and finite-precision quantization in uplink and downlink communications.",
        "labels": "MTD"
    },
    {
        "idx": 72,
        "text": "These analyses reveal that, in order to achieve an O(1/T) convergence rate with quantization, transmitting the weight requires increasing the quantization level at a logarithmic rate, while transmitting the weight differential can keep a constant quantization level.",
        "labels": "CLN"
    },
    {
        "idx": 72,
        "text": "Comprehensive numerical evaluation on various real-world datasets reveals that the benefit of a FL-tailored uplink and downlink communication design is enormous - a carefully designed quantization and transmission achieves more than 98% of the floating-point baseline accuracy with fewer than 10% of the baseline bandwidth, for majority of the experiments on both i.i.d. and non-i.i.d. datasets.",
        "labels": "CLN"
    },
    {
        "idx": 72,
        "text": "In particular, 1-bit quantization (3.1% of the floating-point baseline bandwidth) achieves 99.8% of the floating-point baseline accuracy at almost the same convergence rate on MNIST, representing the best known bandwidth-accuracy tradeoff to the best of the authors' knowledge.",
        "labels": "RST"
    },
    {
        "idx": 73,
        "text": "In this paper, an integrated communication, radar sensing, and mobile-edge computing (CRMEC) architecture is developed, where user terminals (UTs) perform radar sensing and computation offloading simultaneously at the same spectrum by using multiple-input and multiple-output (MIMO) arrays and dual-function radar-communication techniques.",
        "labels": "PUR"
    },
    {
        "idx": 73,
        "text": "We formulate a multi-objective optimization problem to jointly consider the performance of multi-UT MIMO radar beampattern design and computation offloading energy consumption while jointly optimizing individual transmit precoding for radar and communication and computation resource allocation.",
        "labels": "MTD"
    },
    {
        "idx": 73,
        "text": "To address the optimization problem, we first decompose the it into three subproblems and adopt an iterative optimization algorithm.",
        "labels": "MTD"
    },
    {
        "idx": 73,
        "text": "Specifically, quadratic transform based fractional programming methods are used to minimize the offloading energy consumption.",
        "labels": "MTD"
    },
    {
        "idx": 73,
        "text": "The design objective of MIMO radar beampattern is handled by the first-order Taylor expansion.",
        "labels": "MTD"
    },
    {
        "idx": 73,
        "text": "Transmit precoding is designed to optimize radar sensing and computation task offloading.",
        "labels": "MTD"
    },
    {
        "idx": 73,
        "text": "The local and edge computation resource allocation are obtained in closed-form.",
        "labels": "MTD"
    },
    {
        "idx": 73,
        "text": "Numerical results verify the effectiveness of the proposed algorithms.",
        "labels": "CLN"
    },
    {
        "idx": 73,
        "text": "The proposed CRMEC architecture can generate the desired multi-UT MIMO radar beampattern and perform computation offloading simultaneously.",
        "labels": "CLN"
    },
    {
        "idx": 74,
        "text": "For unforeseen natural disasters, such as earthquakes, hurricanes, and floods, etc., the traditional communication infrastructure is unavailable or seriously disrupted along with persistent secondary disasters.",
        "labels": "BAC"
    },
    {
        "idx": 74,
        "text": "Under such circumstances, it is highly demanded to deploy emergency wireless communication (EWC) networks to restore connectivity in accident/ incident areas.",
        "labels": "BAC"
    },
    {
        "idx": 74,
        "text": "The emerging fifth-generation (5G)/beyond-5G (B5G) wireless communication system, like unmanned aerial vehicle (UAV) assisted networks and intelligent reflecting surface (IRS) based communication systems, are expected to be designed or re-farmed for supporting temporary high quality communications in post-disaster areas.",
        "labels": "BAC"
    },
    {
        "idx": 74,
        "text": "However, the channel characteristics of post-disaster areas quickly change as the secondary disaster resulted topographical changes, imposing new but critical challenges for EWC networks.",
        "labels": "GAP"
    },
    {
        "idx": 74,
        "text": "In this paper, we propose a novel heterogeneous $\\mathcal {F}$ composite fading channel model for EWC networks which accurately models and characterizes the composite fading channel with reflectors, path-loss exponent, fading, and shadowing parameters in 5G-UAV based EWC networks.",
        "labels": "PUR"
    },
    {
        "idx": 74,
        "text": "Based on the model, we develop the optimal power allocation scheme with the simple closed-form expression and the numerical results based optimal joint bandwidth-power allocation scheme.",
        "labels": "MTD"
    },
    {
        "idx": 74,
        "text": "We derive the corresponding capacities and compare the energy efficiency between IRS and traditional relay based 5G-UAVs.",
        "labels": "MTD"
    },
    {
        "idx": 74,
        "text": "Numerical results show that the new heterogeneous Fisher-Snedecor $\\mathcal {F}$ composite fading channel adapted resource allocation schemes can achieve higher capacity and energy efficiency than those of traditional channel model adapted resource allocation schemes, thus providing better communications service for post-disaster areas.",
        "labels": "CLN"
    },
    {
        "idx": 75,
        "text": "The increasing amount of data replication across datacenters introduces a need for efficient bulk data transfer protocols which provide certain guarantees, most notably timely transfer completion.",
        "labels": "BAC"
    },
    {
        "idx": 75,
        "text": "We present DaRTree which leverages emerging optical reconfiguration technologies, to jointly optimize topology and multicast transfers in software-defined optical Wide-Area Networks (WANs), and thereby maximize throughput and acceptance ratio of transfer requests subject to transfer deadlines.",
        "labels": "PUR"
    },
    {
        "idx": 75,
        "text": "DaRTree is based on a novel integer linear program relaxation and deterministic rounding scheme.",
        "labels": "MTD"
    },
    {
        "idx": 75,
        "text": "To this end, DaRTree uses Steiner trees for forwarding and adaptive routing based on the current network load.",
        "labels": "MTD"
    },
    {
        "idx": 75,
        "text": "DaRTree provides transfer completion guarantees without the need for rescheduling or preemption.",
        "labels": "MTD"
    },
    {
        "idx": 75,
        "text": "Our evaluations show that DaRTree increases the network throughput and the number of accepted requests by up to 1.7×, especially for larger WANs.",
        "labels": "RST"
    },
    {
        "idx": 75,
        "text": "Moreover, DaRTree even outperforms state-of-the-art solutions when the traffic demands are only unicast transfers or when the WAN topology cannot be reconfigured.",
        "labels": "RST"
    },
    {
        "idx": 75,
        "text": "While DaRTree determines the rate and route to serve a request at the time of (online) admission control, we show that the acceptance ratio and throughput can be improved by up to 1.3× even further when DaRTree updates the rate and route of admitted transfers also at runtime.",
        "labels": "RST"
    },
    {
        "idx": 76,
        "text": "In this paper, the problem of wireless resource allocation and semantic information extraction for energy efficient semantic communications over wireless networks with rate splitting is investigated.",
        "labels": "PUR"
    },
    {
        "idx": 76,
        "text": "In the considered model, a base station (BS) first extracts semantic information from its large-scale data, and then transmits the small-sized semantic information to each user which recovers the original data based on its local common knowledge.",
        "labels": "MTD"
    },
    {
        "idx": 76,
        "text": "At the BS side, the probability graph is used to extract multi-level semantic information.",
        "labels": "MTD"
    },
    {
        "idx": 76,
        "text": "In the downlink transmission, a rate splitting scheme is adopted, while the private small-sized semantic information is transmitted through private message and the common knowledge is transmitted through common message.",
        "labels": "MTD"
    },
    {
        "idx": 76,
        "text": "Due to limited wireless resource, both computation energy and transmission energy are considered.",
        "labels": "MTD"
    },
    {
        "idx": 76,
        "text": "This joint computation and communication problem is formulated as an optimization problem aiming to minimize the total communication and computation energy consumption of the network under computation, latency, and transmit power constraints.",
        "labels": "MTD"
    },
    {
        "idx": 76,
        "text": "To solve this problem, an alternating algorithm is proposed where the closed-form solutions for semantic information extraction ratio and computation frequency are obtained at each step.",
        "labels": "MTD"
    },
    {
        "idx": 76,
        "text": "Numerical results verify the effectiveness of the proposed algorithm.",
        "labels": "CLN"
    },
    {
        "idx": 77,
        "text": "In this paper, we propose a two-layer heterogeneous network to realize the remote monitoring and advanced warning for infectious diseases spread by airborne pathogens, whose detection can be considered as a binary detection problem.",
        "labels": "PUR"
    },
    {
        "idx": 77,
        "text": "To intuitively study the detection process, we abstract it as a molecular communication via diffusion (MCvD) model and uncover that one of the key factors to impact the detection performance is inter-symbol interference (ISI), i.e., the viral aerosol from other biological entities.",
        "labels": "PUR"
    },
    {
        "idx": 77,
        "text": "Therefore, overcoming ISI is imperative to ensure reliable detection.",
        "labels": "BAC"
    },
    {
        "idx": 77,
        "text": "In the abstracted MCvD model, the detection performance can be described by the bit error rate (BER) performance.",
        "labels": "BAC"
    },
    {
        "idx": 77,
        "text": "Following this assumption, we propose to optimize the detection interval to minimize the impact of ISI while ensuring the accurate detection of the transmitted information symbol, which is suitable for both the absorbing and passive receivers.",
        "labels": "PUR"
    },
    {
        "idx": 77,
        "text": "For tractability, based on the signal-to-interference difference (SID) and signal-to-interference-and-noise amplitude ratio (SINAR), we design a modified-SINAR (mSINAR) to measure BER performance for the MCvD system with a variable detection interval.",
        "labels": "MTD"
    },
    {
        "idx": 77,
        "text": "Besides, we derive the optimal detection interval in closed-form.",
        "labels": "MTD"
    },
    {
        "idx": 77,
        "text": "Using simulation results, we show that in terms of BER, our proposed mSINAR scheme is superior to the competitive schemes, and performs similarly to the scheme with optimal intervals determined by the exhaustive search.",
        "labels": "RST"
    },
    {
        "idx": 78,
        "text": "Reconfigurable intelligent surfaces (RISs) have recently emerged as an innovative technology for improving the coverage, throughput, and energy/spectrum efficiency of future wireless communications.",
        "labels": "BAC"
    },
    {
        "idx": 78,
        "text": "In this paper, we propose a new transmission protocol for wideband RIS-assisted single-input multiple-output (SIMO) orthogonal frequency division multiplexing (OFDM) communication systems, where each transmission frame is divided into multiple sub-frames to execute channel estimation simultaneously with passive beamforming.",
        "labels": "PUR"
    },
    {
        "idx": 78,
        "text": "As the training symbols are discretely distributed over multiple sub-frames, the channel state information (CSI) associated with RIS cannot be estimated at once.",
        "labels": "GAP"
    },
    {
        "idx": 78,
        "text": "As such, we propose a new channel estimation method to progressively estimate the associated CSI over consecutive sub-frames, based on which the passive beamforming at the RIS is fine-tuned to improve the achievable rate for data transmission.",
        "labels": "PUR"
    },
    {
        "idx": 78,
        "text": "In particular, during the channel training, the RIS plays two roles of embedding training reflection states for progressive channel estimation and performing passive beamforming for data transmission on the data tones.",
        "labels": "MTD"
    },
    {
        "idx": 78,
        "text": "Based on the estimated CSI in each sub-frame, we formulate an optimization problem to maximize the average achievable rate by designing the passive beamforming at the RIS, which needs to balance the received signal power over different sub-carriers and different receive antennas.",
        "labels": "MTD"
    },
    {
        "idx": 78,
        "text": "As the formulated problem is non-convex and thus difficult to solve optimally, we propose two efficient algorithms to find high-quality solutions.",
        "labels": "MTD"
    },
    {
        "idx": 78,
        "text": "Simulation results validate the effectiveness of the proposed channel estimation and beamforming optimization methods.",
        "labels": "CLN"
    },
    {
        "idx": 78,
        "text": "It is shown that the proposed joint channel estimation and passive beamforming scheme is able to drastically improve the average achievable rate and reduce the delay for data transmission as compared to existing schemes.",
        "labels": "CLN"
    },
    {
        "idx": 79,
        "text": "Due to the big size of data and limited data storage volume of a single computer or a single server, data are often stored in a distributed manner.",
        "labels": "BAC"
    },
    {
        "idx": 79,
        "text": "Thus, performing large-scale machine learning operations with the distributed datasets through communication networks is often required.",
        "labels": "BAC"
    },
    {
        "idx": 79,
        "text": "In this paper, we study the convergence rate of the distributed dual coordinate ascent for distributed machine learning problems in a general tree-structured network.",
        "labels": "PUR"
    },
    {
        "idx": 79,
        "text": "Since a tree network model can be understood as the generalization of a star network, our algorithm can be thought of as the generalization of the distributed dual coordinate ascent in a star network.",
        "labels": "MTD"
    },
    {
        "idx": 79,
        "text": "We provide the convergence rate of the distributed dual coordinate ascent over a general tree network in a recursive manner and analyze the network effect on the convergence rate.",
        "labels": "MTD"
    },
    {
        "idx": 79,
        "text": "Secondly, by considering network communication delays, we optimize the distributed dual coordinate ascent algorithm to maximize its convergence speed.",
        "labels": "MTD"
    },
    {
        "idx": 79,
        "text": "From our analytical result, we can choose the optimal number of local iterations depending on the communication delay severity to achieve the fastest convergence speed.",
        "labels": "RST"
    },
    {
        "idx": 79,
        "text": "In numerical experiments, we consider machine learning scenarios over communication networks, where local workers cannot directly reach to a central node due to constraints in communication, and demonstrate that the usability of our distributed dual coordinate ascent algorithm in tree networks.",
        "labels": "MTD"
    },
    {
        "idx": 80,
        "text": "This paper investigates a multi-node wireless powered communication network (WPCN), where a hybrid access point (HAP) first charges an Internet of Thing (IoT) device wirelessly with the assistance of multiple selfish wireless nodes (WNs), and then the IoT device uses the harvested energy to transmit real-time status updates to the HAP.",
        "labels": "PUR"
    },
    {
        "idx": 80,
        "text": "Two incentive schemes, i.e., the energy-incentive scheme and the price-incentive scheme, are designed to overcome the selfishness of the WNs and enhance the per-packet AoI performance.",
        "labels": "MTD"
    },
    {
        "idx": 80,
        "text": "For the energy-incentive scheme, an AoI-energy utility function is defined and an optimization problem is formulated to maximize the AoI-energy utility value of the HAP-IoT device pair.",
        "labels": "MTD"
    },
    {
        "idx": 80,
        "text": "By using equality constraint elimination and Lagrangian method, the problem is solved and some closed-form solutions are derived to obtain the optimal solution.",
        "labels": "MTD"
    },
    {
        "idx": 80,
        "text": "For the price-incentive scheme, an AoI-price utility function is defined and a Stackelberg game is established to maximize the utility of the HAP-IoT device pair.",
        "labels": "MTD"
    },
    {
        "idx": 80,
        "text": "By using function transformation and Lagrange method, some semi-closed-form solutions are derived to maximize their own profits of the HAP and WNs in a distributed way.",
        "labels": "MTD"
    },
    {
        "idx": 80,
        "text": "Numerical results show that our proposed two incentive mechanisms are able to achieve higher network utility values than the benchmark scheme.",
        "labels": "RST"
    },
    {
        "idx": 80,
        "text": "The more the number of WNs, the lower the AoI of each status update packet and the higher utility value of the HAP.",
        "labels": "RST"
    },
    {
        "idx": 80,
        "text": "It also shows that by positioning WNs closer to the IoT device, the better per-packet AoI performance can be achieved by both incentive mechanisms.",
        "labels": "RST"
    },
    {
        "idx": 80,
        "text": "Additionally, for the energy-incentive mechanism, its achieved AoI gain and energy gain decrease with the increment of the distance between the HAP and the IoT device.",
        "labels": "RST"
    },
    {
        "idx": 80,
        "text": "But for the price-incentive mechanism, the opposite phenomenon is observed.",
        "labels": "RST"
    },
    {
        "idx": 81,
        "text": "A well-known empirical rule for the demand of wireless communication systems is that of Edholm's law of bandwidth.",
        "labels": "BAC"
    },
    {
        "idx": 81,
        "text": "It states that the demand for bandwidth in wireless short-range communications doubles every 18 months.",
        "labels": "BAC"
    },
    {
        "idx": 81,
        "text": "With the growing demand for bandwidth and the decreasing cell size of wireless systems, terahertz (THz) communication systems are expected to become increasingly important in modern day applications.",
        "labels": "BAC"
    },
    {
        "idx": 81,
        "text": "With this expectation comes the need for protecting users' privacy and security in the best way possible.",
        "labels": "BAC"
    },
    {
        "idx": 81,
        "text": "With that in mind, we show that quantum key distribution can operate in the THz regime and we derive the relevant secret key rates against realistic collective attacks.",
        "labels": "RST"
    },
    {
        "idx": 81,
        "text": "In the extended THz range (from 0.1 to 50 THz), we find that below 1 THz, the main detrimental factor is thermal noise, while at higher frequencies it is atmospheric absorption.",
        "labels": "RST"
    },
    {
        "idx": 81,
        "text": "Our results show that high-rate THz quantum cryptography is possible over distances varying from a few meters using direct reconciliation, to about 220m via reverse reconciliation.",
        "labels": "CLN"
    },
    {
        "idx": 81,
        "text": "We also give a specific example of the physical hardware and architecture that could be used to realize our THz quantum key distribution scheme.",
        "labels": "RST"
    },
    {
        "idx": 82,
        "text": "Counter-intuitively, quantum mechanics enables quantum particles to propagate simultaneously among multiple space-time trajectories.",
        "labels": "BAC"
    },
    {
        "idx": 82,
        "text": "Hence, a quantum information carrier can travel through different communication channels in a quantum superposition of different orders, so that the relative causal order of the communication channels becomes indefinite.",
        "labels": "BAC"
    },
    {
        "idx": 82,
        "text": "This is realized by utilizing a quantum device known as quantum switch.",
        "labels": "BAC"
    },
    {
        "idx": 82,
        "text": "In this paper, we investigate, from a communications engineering perspective, the use of the quantum switch within the quantum teleportation process, one of the key functionalities of the Quantum Internet.",
        "labels": "PUR"
    },
    {
        "idx": 82,
        "text": "Specifically, a theoretical analysis is conducted to quantify the performance gain that can be achieved by employing a quantum switch for the entanglement distribution process within the quantum teleportation, with respect to the case of absence of the quantum switch.",
        "labels": "MTD"
    },
    {
        "idx": 82,
        "text": "The analysis reveals that, by utilizing the quantum switch, the quantum teleportation is heralded as a noiseless communication process with a probability that, remarkably and counter-intuitively, increases with the noise levels affecting the communication channels considered in the indefinite-order combination.",
        "labels": "CLN"
    },
    {
        "idx": 83,
        "text": "With the explosive proliferation of connected devices and mobile users in the Internet-of-things, multiple access techniques are urged to be developed for the next generation wireless communications.",
        "labels": "BAC"
    },
    {
        "idx": 83,
        "text": "Recently, rate-splitting multiple access (RSMA) has been a promising communication technology that holds advantages of strong robustness, low complexity, and high spectral efficiency, which can be integrated with the indoor visible light communication (VLC) broadcast system to compensate for the shortcomings of limited modulation bandwidth of LEDs.",
        "labels": "BAC"
    },
    {
        "idx": 83,
        "text": "However, the research on the RSMA-based VLC systems is still in its infancy and there exist various problems to be explored.",
        "labels": "GAP"
    },
    {
        "idx": 83,
        "text": "To benefit from the RSMA technique, this paper investigates the energy efficiency optimizations for both single-cell and multi-cell RSMA-based VLC broadcast systems.",
        "labels": "PUR"
    },
    {
        "idx": 83,
        "text": "Specifically, these two systems are modeled, where the VLC broadcast channel follows Lambertian radiation model, and the splitting design and successive interference cancellation of RSMA are employed to mitigate the multi-user interference.",
        "labels": "MTD"
    },
    {
        "idx": 83,
        "text": "Especially for multi-cell networks, the zero-forcing approach is adopted to eliminate the inter-cell interference.",
        "labels": "MTD"
    },
    {
        "idx": 83,
        "text": "To maximize the energy efficiency, the precoding and power allocation problems are formulated for single-cell and multi-cell networks while accommodating multiple constraints including dynamic operation ranges of LEDs, QoS requirements, and interference elimination.",
        "labels": "MTD"
    },
    {
        "idx": 83,
        "text": "For solving these non-convex fractional problems, two pieces of successive convex approximation (SCA)-based algorithms are proposed, in which the variable transformation and linear approximation are adopted.",
        "labels": "MTD"
    },
    {
        "idx": 83,
        "text": "Simulation results indicate that the proposed schemes can achieve superior energy efficiency with fast convergence for various network loads and user deployments.",
        "labels": "RST"
    },
    {
        "idx": 84,
        "text": "Spatial modulation (SM) is an innovative and promising digital modulation technology that strikes an appealing tradeoff between spectral efficiency and energy efficiency with a simple design philosophy.",
        "labels": "BAC"
    },
    {
        "idx": 84,
        "text": "SM enjoys plenty of benefits and shows great potential to fulfill the requirements of future wireless communications.",
        "labels": "BAC"
    },
    {
        "idx": 84,
        "text": "The key idea behind SM is to convey additional information typically through the ON/OFF states of transmit antennas and simultaneously save the implementation cost by reducing the number of radio-frequency chains.",
        "labels": "BAC"
    },
    {
        "idx": 84,
        "text": "As a result, the SM concept can have widespread effects on diverse applications and can be applied in other signal domains, such as frequency/time/code/angle domain or even across multiple domains.",
        "labels": "BAC"
    },
    {
        "idx": 84,
        "text": "This survey provides a comprehensive overview of the latest results and progresses in SM research.",
        "labels": "PUR"
    },
    {
        "idx": 84,
        "text": "Specifically, the fundamental principles, variants of system design, and enhancements of SM are described in detail.",
        "labels": "MTD"
    },
    {
        "idx": 84,
        "text": "Furthermore, the integration of the SM family with other promising techniques, applications to emerging communication systems, and extensions to new signal domains are also extensively studied.",
        "labels": "MTD"
    },
    {
        "idx": 85,
        "text": "This paper reports on a field trial in a robotic manufacturing cell.",
        "labels": "PUR"
    },
    {
        "idx": 85,
        "text": "Channel measurements and transmission experiments were conducted, assisting the development of a light-emitting diode-based optical wireless communication (OWC) system tailored for the needs of industrial wireless applications.",
        "labels": "MTD"
    },
    {
        "idx": 85,
        "text": "These are moderate data rates, reliability, and low latency.",
        "labels": "MTD"
    },
    {
        "idx": 85,
        "text": "Since dedicated radio spectrum is hardly available, the usage of light is an interesting alternative.",
        "labels": "BAC"
    },
    {
        "idx": 85,
        "text": "Due to its spatial confinement, OWC links provide enhanced security and are difficult to jam from outside a building-a particularly interesting property for industrial applications.",
        "labels": "BAC"
    },
    {
        "idx": 85,
        "text": "We performed broadband distributed $8\\times 6$ multiple-input multiple-output (MIMO) channel measurements in a manufacturing cell.",
        "labels": "MTD"
    },
    {
        "idx": 85,
        "text": "Results confirm that the signal-to-noise ratio is sufficient if a line-of-sight (LOS) is available and bandwidth is limited to a few megahertz.",
        "labels": "CLN"
    },
    {
        "idx": 85,
        "text": "However, small movements and rotations may lead to sudden fades of 10-20 dB, when an LOS is blocked.",
        "labels": "RST"
    },
    {
        "idx": 85,
        "text": "To improve reliability, antenna diversity concepts are applied.",
        "labels": "MTD"
    },
    {
        "idx": 85,
        "text": "Results show that for reliable communication, MIMO diversity schemes are indispensable as it increases the probability of a free LOS significantly.",
        "labels": "RST"
    },
    {
        "idx": 85,
        "text": "Based on these insights, we suggest an OWC design tailored to industrial wireless applications.",
        "labels": "CLN"
    },
    {
        "idx": 86,
        "text": "The Viterbi algorithm is widely adopted in digital communication systems because of its capability of realizing maximum-likelihood signal sequence detection.",
        "labels": "BAC"
    },
    {
        "idx": 86,
        "text": "However, implementation of the Viterbi algorithm requires instantaneous channel state information (CSI) to be available at the receiver.",
        "labels": "GAP"
    },
    {
        "idx": 86,
        "text": "This is difficult to satisfy in some emerging communication systems such as molecular communications, underwater optical communications, etc, where the underlying channel models are highly complex or completely unknown.",
        "labels": "GAP"
    },
    {
        "idx": 86,
        "text": "ViterbiNet, developed in the prior literature, is a promising framework to cope with this challenge, where deep learning (DL) techniques are combined with the Viterbi Algorithm to enable near-optimal signal detection without CSI.",
        "labels": "GAP"
    },
    {
        "idx": 86,
        "text": "This paper offers a non-trivial variation of ViterbiNet based on generative adversarial networks (GAN).",
        "labels": "PUR"
    },
    {
        "idx": 86,
        "text": "Specifically, a novel architecture using GAN is designed to directly learn the channel transition probability (CTP) from receiver observations, which is the only part of the Viterbi algorithm that is channel-dependent.",
        "labels": "MTD"
    },
    {
        "idx": 86,
        "text": "With the learned CTP, the classical Viterbi algorithm can be implemented without modifications.",
        "labels": "MTD"
    },
    {
        "idx": 86,
        "text": "To make the proposed architecture applicable to time-varying channels, we further develop two methods to fine-tune the learned CTP online.",
        "labels": "MTD"
    },
    {
        "idx": 86,
        "text": "In the first method, pilots within each frame are exploited to update the CTP learning network; In the second method, a decision-directed approach is devised to generate training data in real-time, which is utilized to re-train the learning network.",
        "labels": "MTD"
    },
    {
        "idx": 86,
        "text": "By combining these two approaches, the receiver is able to track the dynamic channel conditions without being trained from scratch.",
        "labels": "MTD"
    },
    {
        "idx": 86,
        "text": "Numerical simulations demonstrate the superiority of the proposed design compared to existing methods.",
        "labels": "RST"
    },
    {
        "idx": 87,
        "text": "By means of narrow 2D-steerable infrared beams, interference-free individual wireless connections to densely-spaced devices in industry 4.0 settings can be made.",
        "labels": "MTD"
    },
    {
        "idx": 87,
        "text": "Beam steering by fiber-fed passive diffractive beam steering modules and wavelength-tunable transceivers located in a separate controller location enable readily scalable connectivity to many devices and their nomadic mobility.",
        "labels": "MTD"
    },
    {
        "idx": 87,
        "text": "To accommodate the dynamics in industry 4.0 settings, self-calibrating localization of the devices by means of retro-reflecting corner cube foils and beam scanning is demonstrated, and a low-complexity broadband wide field-of-view optical wireless receiver is presented, based on a matrix of photodiodes.",
        "labels": "CLN"
    },
    {
        "idx": 88,
        "text": "To achieve space-air-ground-sea integrated communication networks for future sixth generation (6G) communications, unmanned aerial vehicle (UAV) communications applying to maritime scenarios serving as mobile base stations have recently attracted more attentions.",
        "labels": "BAC"
    },
    {
        "idx": 88,
        "text": "The UAV-to-ship channel modeling is the fundamental for the system design, testing, and performance evaluation of UAV communication systems in maritime scenarios.",
        "labels": "BAC"
    },
    {
        "idx": 88,
        "text": "In this paper, a novel non-stationary multi-mobility UAV-to-ship channel model is proposed, consisting of three kinds of components, i.e., the line-of-sight (LoS) component, the single-bounce (SB) components resulting from the fluctuation of sea water, and multi-bounce (MB) components introduced by the waveguide effect over the sea surface.",
        "labels": "PUR"
    },
    {
        "idx": 88,
        "text": "In the proposed model, the UAV as the transmitter (Tx), the ship as the receiver (Rx), and the clusters between the Tx and Rx, can be seen as moving with arbitrary velocities and arbitrary directions.",
        "labels": "MTD"
    },
    {
        "idx": 88,
        "text": "Then, some typical statistical properties of the proposed UAV-to-ship channel model, including the temporal autocorrelation function (ACF), spatial cross-correlation function (CCF), Doppler power spectrum density (PSD), delay PSD, angular PSD, stationary interval, and root mean square (RMS) delay spread, are derived and investigated.",
        "labels": "MTD"
    },
    {
        "idx": 88,
        "text": "Finally, by comparing with the available measurement data, the accuracy of proposed channel model is validated.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "A novel semantics-empowered two-user uplink non-orthogonal multiple access (NOMA) framework is proposed for resource efficiency enhancement.",
        "labels": "PUR"
    },
    {
        "idx": 89,
        "text": "More particularly, a secondary far user (F-user) employs the semantic communication (SemCom) while a primary near user (N-user) employs the conventional bit-based communication (BitCom).",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "The fundamental performance limit, namely semantic-versus-bit (SvB) rate region, of the proposed semantics-empowered NOMA framework is characterized.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "The equivalent SvB rate region achieved by the conventional BitCom-based NOMA is provided as the baseline scheme.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "It unveils that, compared to BitCom, SemCom can significantly improve the F-user’s performance when its permitted transmit power is strictly capped, but may perform worse when its permitted transmit power is high.",
        "labels": "RST"
    },
    {
        "idx": 89,
        "text": "Guided by this result, the proposed semantics-empowered NOMA framework is investigated over fading channels.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "An opportunistic SemCom and BitCom scheme is proposed, which enables the secondary F-user to participate in NOMA via the most suitable communication method at each fading state, thus striking a good tradeoff between its own achieved performance and the interference imposed on the primary N-user.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "Two scenarios are considered for employing the opportunistic scheme, namely on-off resource management and continuous resource management.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "For each scenario, the optimal communication policy over fading channels is derived for maximizing the ergodic semantic rate achieved at the secondary F-user, subject to the minimum ergodic bit rate constraint of the primary N-user.",
        "labels": "MTD"
    },
    {
        "idx": 89,
        "text": "Numerical results show that: 1) proposed opportunistic scheme in both scenarios can achieve higher communication performance for NOMA than the baseline schemes merely employing SemCom or BitCom; 2) SemCom can better guarantee the performance of the F-user admitted in NOMA than BitCom when the communication requirement of the primary N-user is high; and 3) continuous power control at the F-user is necessary for ensuring high performance over fading channels, while the on-off time scheduling is sufficient.",
        "labels": "CLN"
    },
    {
        "idx": 90,
        "text": "In this paper, the buffer-constrained throughput performance of a multi-user wireless-powered communication (WPC) system is investigated, where energy harvesting follows a non-linear model.",
        "labels": "PUR"
    },
    {
        "idx": 90,
        "text": "The investigation focuses on the buffer overflow performance of sending data in the downlink (DL) from the access point (AP) node to each user equipment (UE) node and that in the uplink from each UE node to the AP node, based on which the throughput performance on both directions when a buffer constraint is enforced is studied.",
        "labels": "MTD"
    },
    {
        "idx": 90,
        "text": "Specifically, the buffer overflow probability at each node is analyzed, based on which the buffer-constrained throughput is studied.",
        "labels": "MTD"
    },
    {
        "idx": 90,
        "text": "In addition, to ensure the throughput performance under the buffer constraint, the DL transmission power allocation policy and the required energy storage capacity at each UE are investigated.",
        "labels": "MTD"
    },
    {
        "idx": 90,
        "text": "Also, the optimal channel time allocation policy is studied with the objective of maximizing the minimum buffer-constrained throughput guaranteed to each UE at the same time.",
        "labels": "MTD"
    },
    {
        "idx": 90,
        "text": "To this aim, an optimization problem is first formulated and then a dichotomy-based time allocation algorithm combined with a one-dimensional search is proposed to solve this problem.",
        "labels": "MTD"
    },
    {
        "idx": 90,
        "text": "The analysis and results, explicitly relating the throughput to the buffer constraint in addition to WPC characteristics, shed new light on the design and performance analysis of WPC systems.",
        "labels": "CLN"
    },
    {
        "idx": 91,
        "text": "In 5G massive machine-type communication (mMTC), power-limited or battery-free parasite devices such as radio frequency identification (RFID) tags, can use the transmitted signals from host devices as ambient signals for backscatter communications to send information to a base station (BS).",
        "labels": "BAC"
    },
    {
        "idx": 91,
        "text": "Unmanned aerial vehicles (UAVs) can be employed as host devices to help transmissions of parasite devices due to the advantages of high mobility and low operating cost.",
        "labels": "BAC"
    },
    {
        "idx": 91,
        "text": "In this paper, we propose a signal detection approach based on the central limit theorem to detect the presence of parasite devices and separate parasite signals from host signals.",
        "labels": "PUR"
    },
    {
        "idx": 91,
        "text": "Then, closed-form expressions for the probability of error detection and the bit error rate (BER) are derived.",
        "labels": "MTD"
    },
    {
        "idx": 91,
        "text": "Moreover, the trajectory planning of multiple UAVs is optimized with the consideration of minimizing the energy consumption of UAV swarms to serve parasite devices.",
        "labels": "MTD"
    },
    {
        "idx": 91,
        "text": "Theoretical and simulation results show that our proposed method provides good detection performance for parasite devices.",
        "labels": "RST"
    },
    {
        "idx": 91,
        "text": "It also shows that the trajectory planning of multiple UAVs is optimized.",
        "labels": "RST"
    },
    {
        "idx": 92,
        "text": "Thanks to the recent advances in processing speed, data acquisition and storage, machine learning (ML) is penetrating every facet of our lives, and transforming research in many areas in a fundamental manner.",
        "labels": "BAC"
    },
    {
        "idx": 92,
        "text": "Wireless communications is another success story - ubiquitous in our lives, from handheld devices to wearables, smart homes, and automobiles.",
        "labels": "BAC"
    },
    {
        "idx": 92,
        "text": "While recent years have seen a flurry of research activity in exploiting ML tools for various wireless communication problems, the impact of these techniques in practical communication systems and standards is yet to be seen.",
        "labels": "GAP"
    },
    {
        "idx": 92,
        "text": "In this paper, we review some of the major promises and challenges of ML in wireless communication systems, focusing mainly on the physical layer.",
        "labels": "PUR"
    },
    {
        "idx": 92,
        "text": "We present some of the most striking recent accomplishments that ML techniques have achieved with respect to classical approaches, and point to promising research directions where ML is likely to make the biggest impact in the near future.",
        "labels": "MTD"
    },
    {
        "idx": 92,
        "text": "We also highlight the complementary problem of designing physical layer techniques to enable distributed ML at the wireless network edge, which further emphasizes the need to understand and connect ML with fundamental concepts in wireless communications.",
        "labels": "MTD"
    },
    {
        "idx": 93,
        "text": "Semantic communications could improve the transmission efficiency significantly by exploring the semantic information.",
        "labels": "BAC"
    },
    {
        "idx": 93,
        "text": "In this paper, we make an effort to recover the transmitted speech signals in the semantic communication systems, which minimizes the error at the semantic level rather than the bit or symbol level.",
        "labels": "PUR"
    },
    {
        "idx": 93,
        "text": "Particularly, we design a deep learning (DL)-enabled semantic communication system for speech signals, named DeepSC-S.",
        "labels": "MTD"
    },
    {
        "idx": 93,
        "text": "In order to improve the recovery accuracy of speech signals, especially for the essential information, DeepSC-S is developed based on an attention mechanism by utilizing a squeeze-and-excitation (SE) network.",
        "labels": "MTD"
    },
    {
        "idx": 93,
        "text": "The motivation behind the attention mechanism is to identify the essential speech information by providing higher weights to them when training the neural network.",
        "labels": "MTD"
    },
    {
        "idx": 93,
        "text": "Moreover, in order to facilitate the proposed DeepSC-S for dynamic channel environments, we find a general model to cope with various channel conditions without retraining.",
        "labels": "MTD"
    },
    {
        "idx": 93,
        "text": "Furthermore, we investigate DeepSC-S in telephone systems as well as multimedia transmission systems to verify the model adaptation in practice.",
        "labels": "MTD"
    },
    {
        "idx": 93,
        "text": "The simulation results demonstrate that our proposed DeepSC-S outperforms the traditional communications in both cases in terms of the speech signals metrics, such as signal-to-distortion ration and perceptual evaluation of speech distortion.",
        "labels": "RST"
    },
    {
        "idx": 93,
        "text": "Besides, DeepSC-S is more robust to channel variations, especially in the low signal-to-noise (SNR) regime.",
        "labels": "RST"
    },
    {
        "idx": 94,
        "text": "To overcome spectrum congestion, a promising approach is to integrate sensing and communication (ISAC) functions in one hardware platform.",
        "labels": "BAC"
    },
    {
        "idx": 94,
        "text": "Recently, metamaterial antennas, whose tunable radiation elements are arranged more densely than those of traditional multiple-input-multiple-output (MIMO) arrays, have been developed to enhance the sensing and communication performance by offering a finer controllability of the antenna beampattern.",
        "labels": "BAC"
    },
    {
        "idx": 94,
        "text": "In this paper, we propose a holographic beamforming scheme, which is enabled by metamaterial antennas with tunable radiated amplitudes, that jointly performs sensing and communication.",
        "labels": "PUR"
    },
    {
        "idx": 94,
        "text": "However, it is challenging to design the beamformer for ISAC functions by taking into account the unique amplitude-controlled structure of holographic beamforming.",
        "labels": "GAP"
    },
    {
        "idx": 94,
        "text": "To address this challenge, we formulate an integrated sensing and communication problem to optimize the beamformer, and design a holographic beamforming optimization algorithm to efficiently solve the formulated problem.",
        "labels": "MTD"
    },
    {
        "idx": 94,
        "text": "A lower bound for the maximum beampattern gain is provided through theoretical analysis, which reveals the potential performance enhancement gain that is obtained by densely deploying several elements in a metamaterial antenna.",
        "labels": "MTD"
    },
    {
        "idx": 94,
        "text": "Simulation results substantiate the theoretical analysis and show that the maximum beamforming gain of a metamaterial antenna that utilizes the proposed holographic beamforming scheme can be increased by at least 50% compared with that of a traditional MIMO array of the same size.",
        "labels": "RST"
    },
    {
        "idx": 94,
        "text": "In addition, the cost of the proposed scheme is lower than that of a traditional MIMO scheme while providing the same ISAC performance.",
        "labels": "RST"
    },
    {
        "idx": 95,
        "text": "Two key impediments to reconfigurable intelligent surface (RIS)-aided vehicular communications are, respectively, the double fading experienced by the signal on RIS-aided cascaded links and the high-mobility-induced intractability of acquiring channel state information (CSI).",
        "labels": "BAC"
    },
    {
        "idx": 95,
        "text": "To overcome these challenges, a novel kind of RIS is presented in this paper, namely active reconfigurable intelligent omni-surface (RIOS), each element of which is supported by active loads, that concurrently transmits and reflects the incident signal amplified rather than just reflecting it as compared to the case of a passive reflecting-only RIS.",
        "labels": "PUR"
    },
    {
        "idx": 95,
        "text": "We consider the use of an active RIOS to a vehicular communication system for mitigating double fading effect.",
        "labels": "MTD"
    },
    {
        "idx": 95,
        "text": "Specifically, the active RIOS is mounted on the vehicle window to enhance transmission for users in the vehicle and for adjacent vehicles.",
        "labels": "MTD"
    },
    {
        "idx": 95,
        "text": "We aim to jointly optimize the transmit precoding matrix at the base station (BS) and RIOS coefficient matrices to minimize the BS’s transmit power relying exclusively upon the imperfect knowledge of the large-scale CSI.",
        "labels": "MTD"
    },
    {
        "idx": 95,
        "text": "To significantly relax the frequency of channel information updates, initially an efficient transmission protocol is put forward to reap the high active RIOS beamforming gain with low channel training overhead by appropriately tailoring the time-scale of CSI acquisition.",
        "labels": "MTD"
    },
    {
        "idx": 95,
        "text": "Then, two algorithms, namely an alternating optimization (AO)-based algorithm and a constrained stochastic successive convex approximation (CSSCA)-based algorithm, are developed to tackle with the investigated resource allocation problem, whose pros and cons are elaborated, respectively.",
        "labels": "MTD"
    },
    {
        "idx": 95,
        "text": "Simulation results substantiate the significant performance improvement of active RIOS as well as determine the validity and robustness of our proposed algorithms over various benchmark schemes.",
        "labels": "RST"
    },
    {
        "idx": 96,
        "text": "We investigate the potential of adaptive blind equalizers based on variational inference for carrier recovery in optical communications.",
        "labels": "PUR"
    },
    {
        "idx": 96,
        "text": "These equalizers are based on a low-complexity approximation of maximum likelihood channel estimation.",
        "labels": "MTD"
    },
    {
        "idx": 96,
        "text": "We generalize the concept of variational autoencoder (VAE) equalizers to higher order modulation formats encompassing probabilistic constellation shaping (PCS), ubiquitous in optical communications, oversampling at the receiver, and dual-polarization transmission.",
        "labels": "MTD"
    },
    {
        "idx": 96,
        "text": "Besides black-box equalizers based on convolutional neural networks, we propose a model-based equalizer based on a linear butterfly filter and train the filter coefficients using the variational inference paradigm.",
        "labels": "MTD"
    },
    {
        "idx": 96,
        "text": "As a byproduct, the VAE also provides a reliable channel estimation.",
        "labels": "MTD"
    },
    {
        "idx": 96,
        "text": "We analyze the VAE in terms of performance and flexibility over a classical additive white Gaussian noise (AWGN) channel with inter-symbol interference (ISI) and over a dispersive linear optical dual-polarization channel.",
        "labels": "MTD"
    },
    {
        "idx": 96,
        "text": "We show that it can extend the application range of blind adaptive equalizers by outperforming the state-of-the-art constant-modulus algorithm (CMA) for PCS for both fixed but also time-varying channels.",
        "labels": "CLN"
    },
    {
        "idx": 96,
        "text": "The evaluation is accompanied with a hyperparameter analysis.",
        "labels": "MTD"
    },
    {
        "idx": 97,
        "text": "In split machine learning (ML), different partitions of a neural network (NN) are executed by different computing nodes, requiring a large amount of communication cost.",
        "labels": "BAC"
    },
    {
        "idx": 97,
        "text": "As over-the-air computation (OAC) can efficiently implement all or part of the computation at the same time of communication, thus by substituting the wireless transmission in the traditional split ML framework with OAC, the communication load can be eased.",
        "labels": "BAC"
    },
    {
        "idx": 97,
        "text": "In this paper, we propose to deploy split ML in a wireless multiple-input multiple-output (MIMO) communication network utilizing the intricate interplay between MIMO-based OAC and NN.",
        "labels": "PUR"
    },
    {
        "idx": 97,
        "text": "The basic procedure of the OAC split ML system is first provided, and we show that the inter-layer connection in a NN of any size can be mathematically decomposed into a set of linear precoding and combining transformations over a MIMO channel carrying out multi-stream analog communication.",
        "labels": "MTD"
    },
    {
        "idx": 97,
        "text": "The precoding and combining matrices which are regarded as trainable parameters, and the MIMO channel matrix, which are regarded as unknown (implicit) parameters, jointly serve as a fully connected layer of the NN.",
        "labels": "MTD"
    },
    {
        "idx": 97,
        "text": "Most interestingly, the channel estimation procedure can be eliminated by exploiting the MIMO channel reciprocity of the forward and backward propagation, thus greatly saving the system costs and/or further improving its overall efficiency.",
        "labels": "MTD"
    },
    {
        "idx": 97,
        "text": "The generalization of the proposed scheme to the conventional NNs is also introduced, i.e., the widely used convolutional NNs.",
        "labels": "MTD"
    },
    {
        "idx": 97,
        "text": "We demonstrate its effectiveness under both the static and quasi-static memory channel conditions with comprehensive simulations.",
        "labels": "RST"
    },
    {
        "idx": 98,
        "text": "Low-earth orbit (LEO) satellite communication plays an important role in assisting/complementing terrestrial communications by providing worldwide coverage, especially in harsh environments such as high seas, mountains, and deserts which are uncovered by terrestrial networks.",
        "labels": "BAC"
    },
    {
        "idx": 98,
        "text": "Traditionally, the passive reflect-array with fixed phase shifts has been applied in satellite communications to compensate for the high path loss due to long propagation distance with low-cost directional beamforming; however, it is unable to flexibly adapt the beamforming direction to dynamic channel conditions.",
        "labels": "GAP"
    },
    {
        "idx": 98,
        "text": "In view of this, we consider in this paper a new intelligent reflecting surface (IRS)-aided LEO satellite communication system, by utilizing the controllable phase shifts of massive passive reflecting elements to achieve flexible beamforming, which copes with the time-varying channel between the high-mobility satellite (SAT) and ground node (GN) cost-effectively.",
        "labels": "PUR"
    },
    {
        "idx": 98,
        "text": "In particular, we propose a new architecture for IRS-aided LEO satellite communication where IRSs are deployed at both sides of the SAT and GN, and study their cooperative passive beamforming (CPB) design over line-of-sight (LoS)-dominant single-reflection and double-reflection channels.",
        "labels": "PUR"
    },
    {
        "idx": 98,
        "text": "Specifically, we jointly optimize the active transmit/receive beamforming at the SAT/GN as well as the CPB at two-sided IRSs to maximize the overall channel gain from the SAT to each GN.",
        "labels": "MTD"
    },
    {
        "idx": 98,
        "text": "Interestingly, we show that under LoS channel conditions, the high-dimensional SAT-GN channel can be decomposed into the outer product of two low-dimensional vectors.",
        "labels": "RST"
    },
    {
        "idx": 98,
        "text": "By exploiting the decomposed SAT-GN channel, we decouple the original beamforming optimization problem into two simpler subproblems corresponding to the SAT and GN sides, respectively, which are both solved in closed-form.",
        "labels": "MTD"
    },
    {
        "idx": 98,
        "text": "Furthermore, we propose an efficient transmission protocol to conduct channel estimation and beam tracking, which only requires independent processing of the SAT and GN in a distributed manner, thus substantially reducing the implementation complexity.",
        "labels": "MTD"
    },
    {
        "idx": 98,
        "text": "Simulation results validate the performance advantages of the proposed IRS-aided LEO satellite communication system with two-sided cooperative IRSs, as compared to various baseline schemes such as the conventional reflect-array and one-sided IRS.",
        "labels": "RST"
    },
    {
        "idx": 99,
        "text": "In this paper, the issues of transmit hybrid beamforming (HBF) design and direction-of-arrival (DOA) estimation in multi-carrier dual-function radar-communication (DFRC) systems, in consideration of quality-of-service (QoS) for multiple users (MUs), are investigated.",
        "labels": "PUR"
    },
    {
        "idx": 99,
        "text": "In the designed system, communication symbols are embedded into radar pulse interval with multiple orthogonal waveforms, and the HBF is optimized to focus the transmit energy within the spatial sectors of interest by taking the QoS requirement for MUs into account.",
        "labels": "MTD"
    },
    {
        "idx": 99,
        "text": "The problem involving these considerations is formulated as the minimization of mean squared error (MSE) between the achieved spatial spectrum and a desired one, subject to constraints of communication QoS, constant modulus, power and orthogonality.",
        "labels": "MTD"
    },
    {
        "idx": 99,
        "text": "Accordingly, a consensus alternating direction method of multipliers (consensus-ADMM) framework based on weighted mean-square error minimization (WMMSE) is devised to tackle the resultant nonconvex problem.",
        "labels": "MTD"
    },
    {
        "idx": 99,
        "text": "Further, the closed-form solutions of the primal variables are derived.",
        "labels": "MTD"
    },
    {
        "idx": 99,
        "text": "Additionally, the MUltiple SIgnal Classification (MUSIC)-based DOA estimation with the designed HBF architecture is presented, and the corresponding Cramér-Rao bound is derived.",
        "labels": "MTD"
    },
    {
        "idx": 99,
        "text": "Numerical simulations are performed to demonstrate the effectiveness of the proposed designs.",
        "labels": "RST"
    }
]